{
    "items": [
        {
            "id": 16000000,
            "name": "SHELLY",
            "starPowers": [
                {
                    "id": 23000076,
                    "name": "SHELL SHOCK",
                    "description": "Shelly's Super shells slow down enemies for 2 seconds!"
                },
                {
                    "id": 23000135,
                    "name": "BAND-AID",
                    "description": "When Shelly falls below 40% health, she instantly heals for 1110 health. Band-Aid recharges in 15 seconds."
                }
            ],
            "gadgets": [
                {
                    "id": 23000255,
                    "name": "FAST FORWARD",
                    "description": "Shelly dashes ahead, skipping a few unnecessary steps!"
                },
                {
                    "id": 23000288,
                    "name": "CLAY PIGEONS",
                    "description": "On activation, for the next 5 seconds Shelly's main attacks focus the fire to a smaller area with an increased range."
                }
            ],
            "rarity": {
                "id": 100001,
                "name": "COMMON"
            },
            "description": "Shelly's the perfect ranger: reliable, tough, and terrific with her shotgun. She never understood why Colt got to steal the limelight...",
            "attack": {
                "name": "Buckshot",
                "description": "Shelly's boomstick fires a wide spread of pellets to a medium range. The more pellets hit, the greater the damage."
            },
            "super": {
                "name": "Super Shell",
                "description": "Shelly's Super Shell obliterates both cover and enemies. Any survivors get knocked back."
            },
            "hypercharge": {
                "name": "DOUBLE BARREL",
                "description": "Buffs while Hypercharged. Super Shell is 33% larger."
            },
            "class": {
                "name": "DAMAGE DEALER",
                "id": 2010
            }
        },
        {
            "id": 16000001,
            "name": "COLT",
            "starPowers": [
                {
                    "id": 23000077,
                    "name": "SLICK BOOTS",
                    "description": "Colt's movement speed is increased by 13%."
                },
                {
                    "id": 23000138,
                    "name": "MAGNUM SPECIAL",
                    "description": "Colt's attack range and bullet speed are increased by 11%."
                }
            ],
            "gadgets": [
                {
                    "id": 23000273,
                    "name": "SPEEDLOADER",
                    "description": "Colt instantly reloads 2 ammo."
                },
                {
                    "id": 23000319,
                    "name": "SILVER BULLET",
                    "description": "Colt's next attack is a powerful shot that deals as much damage as 2 of his regular bullets, while going through obstacles and opponents alike."
                }
            ],
            "rarity": {
                "id": 100002,
                "name": "RARE"
            },
            "attack": {
                "name": "Six-Shooters",
                "description": "Colt shoots six straight long-range shots out of his revolvers."
            },
            "super": {
                "name": "Bullet Storm",
                "description": "Colt rattles off a massive burst of bullets that shoot extra far and destroy cover."
            },
            "hypercharge": {
                "name": "Dual Wielding",
                "description": "Bullet Storm is 120% wider."
            },
            "class": {
                "name": "DAMAGE DEALER",
                "id": 2010
            },
            "description": "Colt is the star attraction at Starr Park! His good looks, charisma and gun twirling tricks win over any audience, except maybe Shelly."
        },
        {
            "id": 16000002,
            "name": "BULL",
            "starPowers": [
                {
                    "id": 23000078,
                    "name": "BERSERKER",
                    "description": "When Bull falls below 60% health, his reload speed doubles!"
                },
                {
                    "id": 23000137,
                    "name": "TOUGH GUY",
                    "description": "When Bull falls below 40% health, he gains a shield that reduces all damage he takes by 30%."
                }
            ],
            "gadgets": [
                {
                    "id": 23000272,
                    "name": "T-BONE INJECTOR",
                    "description": "Bull instantly rejuvenates himself for 1000 health."
                },
                {
                    "id": 23000310,
                    "name": "STOMPER",
                    "description": "Bull can interrupt his Super charge and slow all nearby opponents with a massive stomp for 1.5 seconds."
                }
            ],
            "rarity": {
                "id": 100002,
                "name": "RARE"
            },
            "attack": {
                "name": "Double-Barrel",
                "description": "Bull's double-barreled shotgun deals heavy damage. It has very short range, so Bull likes to get up close and personal."
            },
            "super": {
                "name": "Bulldozer",
                "description": "Bull puts his head down and bulldozes through opponents and obstacles. He's always been headstrong!"
            },
            "hypercharge": {
                "name": "Jaws Of Steel",
                "description": "Bulldozer reduces damage taken by 80%."
            },
            "class": {
                "name": "TANK",
                "id": 2011
            },
            "description": "Bull isn't as carefree as he was in his youth, but just because his rowdy days are behind him doesn't mean he won't still crush someone who's asking for it."
        },
        {
            "id": 16000003,
            "name": "BROCK",
            "starPowers": [
                {
                    "id": 23000079,
                    "name": "MORE ROCKETS!",
                    "description": "Rocket Rain now rains down 44% more rockets."
                },
                {
                    "id": 23000150,
                    "name": "ROCKET NO. 4",
                    "description": "Brock loads a fourth rocket into his launcher, increasing his ammo capacity (and discarding the thermos bottle he's been keeping in his launcher's fourth tube)."
                }
            ],
            "gadgets": [
                {
                    "id": 23000245,
                    "name": "ROCKET LACES",
                    "description": "Brock blasts the ground below him and propels himself into the air. The explosion deals 464 damage to nearby enemies."
                },
                {
                    "id": 23000316,
                    "name": "ROCKET FUEL",
                    "description": "Brock's next attack is a mega rocket that is bigger, badder, faster and destroys walls."
                }
            ],
            "rarity": {
                "id": 100002,
                "name": "RARE"
            },
            "attack": {
                "name": "Rockin' Rocket",
                "description": "Brock lets fly with a single Rockin' Rocket that really goes the distance."
            },
            "super": {
                "name": "Rocket Rain",
                "description": "Brock fires a rocket barrage that takes out enemies and obstacles. He only wants to see you bathing in the Rocket Rain!"
            },
            "hypercharge": {
                "name": "Rocket Barrage",
                "description": "Brock fires a Rocket Barrage, raining down rockets in the targeted area simultaneously in 4 waves."
            },
            "class": {
                "name": "MARKSMAN",
                "id": 2012
            },
            "description": "Brock is a smack-talking video game enthusiast. His big attitude hides a more introverted personality, but he'll still do whatever it takes to win!"
        },
        {
            "id": 16000004,
            "name": "RICO",
            "starPowers": [
                {
                    "id": 23000080,
                    "name": "SUPER BOUNCY",
                    "description": "Rico's bullets, from attack and Super alike, get Supercharged by their first bounce and deal +128 damage!"
                },
                {
                    "id": 23000156,
                    "name": "ROBO RETREAT",
                    "description": "When Rico falls below 40% health, he runs 34% faster!"
                }
            ],
            "gadgets": [
                {
                    "id": 23000246,
                    "name": "MULTIBALL LAUNCHER",
                    "description": "Rico blasts waves of bouncy bullets in all directions."
                },
                {
                    "id": 23000409,
                    "name": "BOUNCY CASTLE",
                    "description": "Rico's next basic attack will heal him for 128 health from each projectile bounce."
                }
            ],
            "rarity": {
                "id": 100003,
                "name": "SUPER RARE"
            },
            "attack": {
                "name": "Bouncy Bullets",
                "description": "Rico's bullets bounce off walls, gaining range. They can hit enemies behind cover."
            },
            "super": {
                "name": "Trick Shot",
                "description": "Rico fires a long burst of bullets that pierce through enemies and bounce off walls, gaining range."
            },
            "hypercharge": {
                "name": "Trick Shot King",
                "description": "Rico’s Super's projectiles bounce even further!"
            },
            "class": {
                "name": "DAMAGE DEALER",
                "id": 2010
            },
            "description": "Rico is definitely a real space bounty hunter who tracks down the galaxy's most wanted criminals, not a gumball machine pretending to be cool."
        },
        {
            "id": 16000005,
            "name": "SPIKE",
            "starPowers": [
                {
                    "id": 23000081,
                    "name": "FERTILIZE",
                    "description": "After using Super, Spike regenerates 700 health per second by staying in its area of effect."
                },
                {
                    "id": 23000151,
                    "name": "CURVEBALL",
                    "description": "Spikes from the cactus grenade fly in a curving motion, making it easier to hit targets."
                }
            ],
            "gadgets": [
                {
                    "id": 23000247,
                    "name": "POPPING PINCUSHION",
                    "description": "Spike shoots 3 waves of needles in all directions, dealing 540 damage per hit."
                },
                {
                    "id": 23000406,
                    "name": "LIFE PLANT",
                    "description": "Spike grows a large cactus with 1400 health to give cover to friendlies. If destroyed, the cactus bursts, and all nearby friendlies recover 840 health."
                }
            ],
            "rarity": {
                "id": 100006,
                "name": "LEGENDARY"
            },
            "attack": {
                "name": "Needle Grenade",
                "description": "Spike fires off a small cactus that explodes, shooting spikes in different directions."
            },
            "super": {
                "name": "Stick Around!",
                "description": "Spike lobs a thorny grenade. Enemies caught in the blast area take damage and are slowed down."
            },
            "hypercharge": {
                "name": "Blooming Season",
                "description": "Stick Around has 20% larger area."
            },
            "class": {
                "name": "DAMAGE DEALER",
                "id": 2010
            },
            "description": "Most people think Spike is Colt and Shelly's cute sidekick at the Ranger Ranch. Nobody could begin to guess the depths of his trauma"
        },
        {
            "id": 16000006,
            "name": "BARLEY",
            "starPowers": [
                {
                    "id": 23000082,
                    "name": "MEDICAL USE",
                    "description": "Barley regains 240 health from each attack."
                },
                {
                    "id": 23000158,
                    "name": "EXTRA NOXIOUS",
                    "description": "Adds +200 damage per second to Barley's attack."
                }
            ],
            "gadgets": [
                {
                    "id": 23000250,
                    "name": "STICKY SYRUP MIXER",
                    "description": "Barley drops a sticky concoction that leaves a puddle, slowing down all enemies that make contact with it."
                },
                {
                    "id": 23000293,
                    "name": "HERBAL TONIC",
                    "description": "Barley throws a healing potion at nearby allies that creates an area that heals for 360 health per second."
                }
            ],
            "rarity": {
                "id": 100002,
                "name": "RARE"
            },
            "attack": {
                "name": "Undiluted",
                "description": "Barley lobs a bottle, breaking it on the ground. Enemies take damage from the splash, and more damage over time if they stay in the puddle."
            },
            "super": {
                "name": "Last Call",
                "description": "Barley hurls a flurry of fiery bottles, covering a huge area in flames. This one's on the house!"
            },
            "hypercharge": {
                "name": "Bottled-Up Rage",
                "description": "Barley hurls 3 big brews that also destroy all bushes on impact."
            },
            "class": {
                "name": "ARTILLERY",
                "id": 2016
            },
            "description": "A bartending robot designed to mix drinks and banter with patrons, Barley also makes sure to keep his bar clean, to the detriment of anyone who makes a mess."
        },
        {
            "id": 16000007,
            "name": "JESSIE",
            "starPowers": [
                {
                    "id": 23000083,
                    "name": "ENERGIZE",
                    "description": "Jessie can repair her gun turret for 42 of its missing health by zapping it with her attack."
                },
                {
                    "id": 23000149,
                    "name": "SHOCKY",
                    "description": "Scrappy the Turret now shoots energy orbs that bounce between enemies. The orbs' range after a bounce is 51% of normal range."
                }
            ],
            "gadgets": [
                {
                    "id": 23000251,
                    "name": "SPARK PLUG",
                    "description": "Jessie triggers a shockwave from her turret, slowing down all enemies within its area of effect."
                },
                {
                    "id": 23000295,
                    "name": "RECOIL SPRING",
                    "description": "Scrappy's attack speed is doubled for 5 seconds."
                }
            ],
            "rarity": {
                "id": 100003,
                "name": "SUPER RARE"
            },
            "attack": {
                "name": "Shock Rifle",
                "description": "Jessie fires off an energy orb. After hitting a target the orb bounces to the next target in range, hitting up to three enemies. Each bounce deals 25% less damage."
            },
            "super": {
                "name": "Scrappy",
                "description": "Jessie deploys a gun turret that automatically shoots at enemies. It's made of 100% recycled materials!"
            },
            "hypercharge": {
                "name": "Scrappy 2.0",
                "description": "Jessie's turret has 50% more health and deals 20% more damage."
            },
            "class": {
                "name": "CONTROLLER",
                "id": 2013
            },
            "description": "Jessie is a prodigy who builds guns and gadgets from parts she finds in the junkyard. Maybe one day her mother Pam will see she can fend for herself!"
        },
        {
            "id": 16000008,
            "name": "NITA",
            "starPowers": [
                {
                    "id": 23000084,
                    "name": "BEAR WITH ME",
                    "description": "Nita recovers 520 health whenever her bear hits an enemy Brawler. When Nita deals damage to an enemy Brawler, her bear regains 520 health."
                },
                {
                    "id": 23000136,
                    "name": "HYPER BEAR",
                    "description": "Nita's bear attacks faster. Time between swipes is reduced by 60%."
                }
            ],
            "gadgets": [
                {
                    "id": 23000249,
                    "name": "BEAR PAWS",
                    "description": "Nita commands her bear to slam the ground, stunning all enemies within its reach."
                },
                {
                    "id": 23000314,
                    "name": "FAUX FUR",
                    "description": "For the next 3 seconds, Nita's bear gets a 35% shield against damage."
                }
            ],
            "rarity": {
                "id": 100002,
                "name": "RARE"
            },
            "attack": {
                "name": "Rupture",
                "description": "Nita sends forth a shockwave, damaging enemies caught in the tremor."
            },
            "super": {
                "name": "Overbearing",
                "description": "Nita summons the spirit of Big Baby Bear to hunt down her enemies."
            },
            "hypercharge": {
                "name": "Hyperbearing",
                "description": "Nita hypercharges Bruce, making him increase in size, giving him 15% increased movement speed and 20% increased health."
            },
            "class": {
                "name": "DAMAGE DEALER",
                "id": 2010
            },
            "description": "Nita is a ferocious child who never backs down from a fight! The teddy bear on her head serves as a warning to others: don't poke the bear."
        },
        {
            "id": 16000009,
            "name": "DYNAMIKE",
            "starPowers": [
                {
                    "id": 23000085,
                    "name": "DYNA-JUMP",
                    "description": "Dynamike can ride the blast wave of his explosives to jump over obstacles!"
                },
                {
                    "id": 23000155,
                    "name": "DEMOLITION",
                    "description": "Adds +800 damage to Mike's Super."
                }
            ],
            "gadgets": [
                {
                    "id": 23000258,
                    "name": "FIDGET SPINNER",
                    "description": "Dynamike spins furiously with increased movement speed and throws multiple sticks of dynamite around himself. Each dynamite deals 1200 damage to enemies."
                },
                {
                    "id": 23000294,
                    "name": "SATCHEL CHARGE",
                    "description": "Once activated, the next main attack also stuns enemies for 1.5 seconds."
                }
            ],
            "rarity": {
                "id": 100003,
                "name": "SUPER RARE"
            },
            "attack": {
                "name": "Short Fuse",
                "description": "Mike tosses two sticks of dynamite, passing over any obstacles in the way. The fuses are cut as short as Mike's explosive temper!"
            },
            "super": {
                "name": "Big Barrel O' Boom",
                "description": "A big-bada-barrel of dynamite blows up cover. Any surviving enemies get knocked back on impact!"
            },
            "hypercharge": {
                "name": "Boomer",
                "description": "Super bomb spawns smaller bombs."
            },
            "class": {
                "name": "ARTILLERY",
                "id": 2016
            },
            "description": "Dynamike is an old miner and prospector who's become obsessed with explosions. Nothing makes him happier than a big boom!"
        },
        {
            "id": 16000010,
            "name": "EL PRIMO",
            "starPowers": [
                {
                    "id": 23000086,
                    "name": "EL FUEGO",
                    "description": "Enemies caught in El Primo's Super will burn for 893 damage over 4 seconds."
                },
                {
                    "id": 23000140,
                    "name": "METEOR RUSH",
                    "description": "El Primo gains a 25% speed boost for 4 seconds after using his Super."
                }
            ],
            "gadgets": [
                {
                    "id": 23000264,
                    "name": "SUPLEX SUPPLEMENT",
                    "description": "El Primo grabs the closest enemy within his reach and flips them like a pancake over his broad shoulders."
                },
                {
                    "id": 23000292,
                    "name": "ASTEROID BELT",
                    "description": "El Primo summons a small meteor to strike the nearest enemy. It deals 1520 damage and destroys walls."
                }
            ],
            "rarity": {
                "id": 100002,
                "name": "RARE"
            },
            "attack": {
                "name": "Fists Of Fury",
                "description": "El Primo fires off a furious flurry of four fiery fists. That's a spicy jalapeno knuckle sandwich!"
            },
            "super": {
                "name": "Flying Elbow Drop",
                "description": "Leaping high, El Primo drops an Intergalactic Elbow that knocks around enemies and destroys cover!"
            },
            "hypercharge": {
                "name": "Gravity Leap",
                "description": "Leaping high, El Primo drops an Intergalactic Elbow that brings enemies to the Epicenter"
            },
            "class": {
                "name": "TANK",
                "id": 2011
            },
            "description": "El Primo is always in the spotlight and that's right where he wants to be! There's no audience he can't win over, except maybe his fellow performers..."
        },
        {
            "id": 16000011,
            "name": "MORTIS",
            "starPowers": [
                {
                    "id": 23000087,
                    "name": "CREEPY HARVEST",
                    "description": "Mortis reaps the life essence of Brawlers he defeats, restoring 20% of his max health."
                },
                {
                    "id": 23000154,
                    "name": "COILED SNAKE",
                    "description": "Mortis gains his longer dash 2 seconds faster."
                }
            ],
            "gadgets": [
                {
                    "id": 23000265,
                    "name": "COMBO SPINNER",
                    "description": "Mortis spins his shovel, hitting all enemies around himself for 1000 damage."
                },
                {
                    "id": 23000290,
                    "name": "SURVIVAL SHOVEL",
                    "description": "Mortis reloads faster for 4 seconds."
                }
            ],
            "rarity": {
                "id": 100005,
                "name": "MYTHIC"
            },
            "attack": {
                "name": "Shovel Swing",
                "description": "Mortis dashes forward with a sharp swing of his shovel, creating business opportunities for himself. When he has all three dashes ready, he'll gain a longer dash after a short delay."
            },
            "super": {
                "name": "Life Blood",
                "description": "Mortis calls forth a swarm of vampire bats that drain the health of enemy Brawlers while restoring his. Creepy!"
            },
            "hypercharge": {
                "name": "Blood Boomerang",
                "description": "Life Blood now also returns to Mortis, allowing for double damage and healing."
            },
            "class": {
                "name": "ASSASSIN",
                "id": 2015
            },
            "description": "Mortis had grand designs built around being a mortician and a vampire, but the fact that nobody is dying at Starr Park has put a huge damper on his plans."
        },
        {
            "id": 16000012,
            "name": "CROW",
            "starPowers": [
                {
                    "id": 23000088,
                    "name": "EXTRA TOXIC",
                    "description": "Crow's poison saps the strength of enemies, who deal 15% less damage while poisoned."
                },
                {
                    "id": 23000143,
                    "name": "CARRION CROW",
                    "description": "Crow deals +128 damage with his attack and Super to targets with 50% or less health."
                }
            ],
            "gadgets": [
                {
                    "id": 23000243,
                    "name": "DEFENSE BOOSTER",
                    "description": "Crow gets a shield for 40% of incoming damage for 3 seconds."
                },
                {
                    "id": 23000286,
                    "name": "SLOWING TOXIN",
                    "description": "All currently poisoned enemies are slowed for 2 seconds."
                }
            ],
            "rarity": {
                "id": 100006,
                "name": "LEGENDARY"
            },
            "attack": {
                "name": "Switchblade",
                "description": "Crow throws a triple threat of daggers. Enemies hit by the poisoned blades will take damage over time and have all healing effects reduced for the duration."
            },
            "super": {
                "name": "Swoop",
                "description": "Crow takes to the skies, throwing a ring of poisoned daggers around him both on take-off and landing."
            },
            "hypercharge": {
                "name": "Utility Knives",
                "description": "Crow's knives are piercing and are returning like a boomerang."
            },
            "class": {
                "name": "ASSASSIN",
                "id": 2015
            },
            "description": "Crow trusts no one and keeps to himself. The most anyone knows about him is that he's often found at the diner, hanging out with Bull and Bibi."
        },
        {
            "id": 16000013,
            "name": "POCO",
            "starPowers": [
                {
                    "id": 23000089,
                    "name": "DA CAPO!",
                    "description": "When Poco's attack hits friendly Brawlers they now heal for 479 health."
                },
                {
                    "id": 23000144,
                    "name": "SCREECHING SOLO",
                    "description": "Poco's Super now also hits enemies, dealing 760 damage."
                }
            ],
            "gadgets": [
                {
                    "id": 23000267,
                    "name": "TUNING FORK",
                    "description": "Poco and all nearby allies heal 370 health per second for 5 seconds."
                },
                {
                    "id": 23000350,
                    "name": "PROTECTIVE TUNES",
                    "description": "Removes active adverse effects from friendly Brawlers in a large area and gives a 4 second immunity."
                }
            ],
            "rarity": {
                "id": 100002,
                "name": "RARE"
            },
            "attack": {
                "name": "Power Chord",
                "description": "Poco strums his guitarrón, sending forward bone-jarring sound waves. Enemies hit by the waves take damage."
            },
            "super": {
                "name": "Encore",
                "description": "Poco heals himself and all friends he can reach with his uplifting melody. Does not affect enemies."
            },
            "hypercharge": {
                "name": "Medic's Melody",
                "description": "Encore now overheals, adding a decaying shield for the amount overhealed. Shield lasts for 5 seconds."
            },
            "class": {
                "name": "SUPPORT",
                "id": 2014
            },
            "description": "Poco believes music can change people's lives. He's so enthusiastic about it that he never stops playing, even after people ask him to!"
        },
        {
            "id": 16000014,
            "name": "BO",
            "starPowers": [
                {
                    "id": 23000090,
                    "name": "CIRCLING EAGLE",
                    "description": "Bo spots enemies hidden in bushes from 150% longer distance than normally."
                },
                {
                    "id": 23000148,
                    "name": "SNARE A BEAR",
                    "description": "Instead of a knockback, Bo's traps now stun the enemy for 2 seconds!"
                }
            ],
            "gadgets": [
                {
                    "id": 23000263,
                    "name": "SUPER TOTEM",
                    "description": "Bo places a totem that increases allies' Super charging rate by 50%. The totem slowly loses its health over time."
                },
                {
                    "id": 23000289,
                    "name": "TRIPWIRE",
                    "description": "Bo triggers all of his mines after 1.5 seconds. During the delay the mines are completely undetectable to opponents."
                }
            ],
            "rarity": {
                "id": 100004,
                "name": "EPIC"
            },
            "attack": {
                "name": "Eagle-Eyed",
                "description": "Bo releases a trio of exploding arrows, tearing up enemies like an eagle's talons."
            },
            "super": {
                "name": "Catch A Fox",
                "description": "Bo hides explosive traps in the ground. When triggered by an enemy, the traps explode after a short delay, knocking back and damaging enemies."
            },
            "hypercharge": {
                "name": "Catch a Bear",
                "description": "Bo's Super deploys 5 mines instead of 3. These do not override any mines already placed by his Super, so it is possible to have more than 7 mines on the map!"
            },
            "class": {
                "name": "CONTROLLER",
                "id": 2013
            },
            "description": "Bo has survived in the Rumble Jungle for a long time. It's all the more impressive considering he's been using toys he got on sale from the Gift Shop."
        },
        {
            "id": 16000015,
            "name": "PIPER",
            "starPowers": [
                {
                    "id": 23000091,
                    "name": "AMBUSH",
                    "description": "Piper's attack deals +595 extra damage (at max range) when she's hidden in a bush."
                },
                {
                    "id": 23000152,
                    "name": "SNAPPY SNIPING",
                    "description": "When Piper hits an opponent with her attack, she reloads 0.4 ammo instantly."
                }
            ],
            "gadgets": [
                {
                    "id": 23000268,
                    "name": "AUTO AIMER",
                    "description": "Piper pops a defensive shot at the closest enemy, dealing 85 damage, while also pushing them back."
                },
                {
                    "id": 23000291,
                    "name": "HOMEMADE RECIPE",
                    "description": "On activation, Piper's next main attack will home in on enemies."
                }
            ],
            "rarity": {
                "id": 100004,
                "name": "EPIC"
            },
            "attack": {
                "name": "Gunbrella",
                "description": "Piper fires a sniper shot from the tip of her parasol. The shot gains more oompf the farther it flies!"
            },
            "super": {
                "name": "Poppin'",
                "description": "Piper hops away to avoid pushy suitors. She leaves them a lady's favor though: live grenades from her garter!"
            },
            "hypercharge": {
                "name": "Boppin'",
                "description": "Piper drops even more bombs as she departs at an increased speed! She also destroys terrain when she lands."
            },
            "class": {
                "name": "MARKSMAN",
                "id": 2012
            },
            "description": "Piper wants nothing more than to be the local village baker who hands out pies, cookies and other sweet treats! Just don't ask about her past."
        },
        {
            "id": 16000016,
            "name": "PAM",
            "starPowers": [
                {
                    "id": 23000092,
                    "name": "MAMA'S HUG",
                    "description": "Whenever Pam hits enemy Brawlers with Scrapstorm, she heals herself and nearby friendly Brawlers for 48 health."
                },
                {
                    "id": 23000139,
                    "name": "MAMA'S SQUEEZE",
                    "description": "Healing turret now also damages enemies for 480 damage per second."
                }
            ],
            "gadgets": [
                {
                    "id": 23000257,
                    "name": "PULSE MODULATOR",
                    "description": "Pam triggers her turret to emit a pulse that heals allies inside the turret's range, including herself, for 960 health."
                },
                {
                    "id": 23000404,
                    "name": "SCRAPSUCKER",
                    "description": "Each hit from Pam's next attack removes 25% of opposing Brawlers' maximum ammo. Pam reclaims 50% of the ammo for herself."
                }
            ],
            "rarity": {
                "id": 100004,
                "name": "EPIC"
            },
            "attack": {
                "name": "Scrapstorm",
                "description": "Pam sprays a large area with bursts of scrap metal. Safety goggles advised!."
            },
            "super": {
                "name": "Mama's Kiss",
                "description": "Pam's healing turret will fix up her and teammates who stay in its area of effect."
            },
            "hypercharge": {
                "name": "",
                "description": ""
            },
            "class": {
                "name": "SUPPORT",
                "id": 2014
            },
            "description": "Pam handles an enormous workload at the junkyard and always gets it done! It's just a shame it keeps her away from her daughter, Jessie..."
        },
        {
            "id": 16000017,
            "name": "TARA",
            "starPowers": [
                {
                    "id": 23000093,
                    "name": "BLACK PORTAL",
                    "description": "Tara's Super cracks open a dimensional portal! A shadowy version of Tara appears and attacks her enemies."
                },
                {
                    "id": 23000160,
                    "name": "HEALING SHADE",
                    "description": "Tara's Super cracks open a dimensional portal! A shadowy version of Tara appears to heal Tara and her teammates."
                }
            ],
            "gadgets": [
                {
                    "id": 23000266,
                    "name": "PSYCHIC ENHANCER",
                    "description": "Tara and her allies are able to see all enemies, even inside bushes, for 4 seconds."
                },
                {
                    "id": 23000356,
                    "name": "SUPPORT FROM BEYOND",
                    "description": "Tara surrounds herself with three weak shadows that attack opponents and disappear after 6 seconds."
                }
            ],
            "rarity": {
                "id": 100005,
                "name": "MYTHIC"
            },
            "attack": {
                "name": "Triple Tarot",
                "description": "Tara flicks her wrist, snapping off three tarot cards that pierce through enemies. Quite a trick!"
            },
            "super": {
                "name": "Gravity",
                "description": "Tara conjures up a mind-boggling gravity well! Enemies in the area of effect get pulled in, crashing together painfully hard."
            },
            "hypercharge": {
                "name": "Supermassive",
                "description": "Gravity has 20% larger area."
            },
            "class": {
                "name": "DAMAGE DEALER",
                "id": 2010
            },
            "description": "Tara has seen in the cards that great difficulties lie ahead! But don't despair... she has a terrific selection of magical trinkets for sale to help with that."
        },
        {
            "id": 16000018,
            "name": "DARRYL",
            "starPowers": [
                {
                    "id": 23000094,
                    "name": "STEEL HOOPS",
                    "description": "After Barrel Roll all damage Darryl takes is reduced by 25% for 2 seconds."
                },
                {
                    "id": 23000157,
                    "name": "ROLLING RELOAD",
                    "description": "When Darryl uses his Super, he doubles his reload speed for 5 seconds."
                }
            ],
            "gadgets": [
                {
                    "id": 23000260,
                    "name": "RECOILING ROTATOR",
                    "description": "Darryl spins around and sprays a barrage of shots in all directions. Each shot deals 300 damage and recharges his Super by 25% if it hits enemies!"
                },
                {
                    "id": 23000313,
                    "name": "TAR BARREL",
                    "description": "Darryl creates a slowing area around himself for 5 seconds."
                }
            ],
            "rarity": {
                "id": 100003,
                "name": "SUPER RARE"
            },
            "attack": {
                "name": "Double Deuce",
                "description": "Darryl's double barrel shotguns fire two staggered blasts of heavy close-range damage."
            },
            "super": {
                "name": "Barrel Roll",
                "description": "Darryl rolls forward inside his barrel, knocking back enemies, reducing incoming damage and bouncing off walls. His Super recharges over time!"
            },
            "hypercharge": {
                "name": "Barrel o' Bullets",
                "description": "Shoots his shotguns around himself during a Barrel Roll. Each shot does 300 damage."
            },
            "class": {
                "name": "TANK",
                "id": 2011
            },
            "description": "Darryl put on the pirate captain's hat in a bid to avoid work, but now he's forced to defend his ship! Who knew being in charge took actual effort?"
        },
        {
            "id": 16000019,
            "name": "PENNY",
            "starPowers": [
                {
                    "id": 23000099,
                    "name": "HEAVY COFFERS",
                    "description": "Penny's gold pouches burst with a 100% wider cone after each hit."
                },
                {
                    "id": 23000142,
                    "name": "MASTER BLASTER",
                    "description": "Penny's cannon deals 686 damage and knocks back nearby enemies on landing."
                }
            ],
            "gadgets": [
                {
                    "id": 23000248,
                    "name": "SALTY BARREL",
                    "description": "Penny drops a barrel of salt that blocks enemy projectiles. She can also use it to burst her own gold pouches."
                },
                {
                    "id": 23000287,
                    "name": "TRUSTY SPYGLASS",
                    "description": "Penny's cannon blasts at every visible enemy position within range."
                }
            ],
            "rarity": {
                "id": 100003,
                "name": "SUPER RARE"
            },
            "attack": {
                "name": "Plunderbuss",
                "description": "Shoots out a pouch of fool's gold. If the pouch hits an enemy, it bursts and coins pepper targets behind the first enemy."
            },
            "super": {
                "name": "Old Lobber",
                "description": "Penny sets up her cannon! It can shoot at enemies at a long range, over cover and setting the ground on fire."
            },
            "hypercharge": {
                "name": "New Lobber",
                "description": "Penny deploys a bigger cannon that shoots 2 cannonballs at a time instead of 1."
            },
            "class": {
                "name": "CONTROLLER",
                "id": 2013
            },
            "description": "Penny doesn't care about studying old maps or puzzling over sea shanty riddles. She's a pirate so she can blow stuff up and grab whatever she wants!"
        },
        {
            "id": 16000020,
            "name": "FRANK",
            "starPowers": [
                {
                    "id": 23000104,
                    "name": "POWER GRAB",
                    "description": "Frank steals the power of a Brawler he defeats, increasing his damage by 25% for 12 seconds!"
                },
                {
                    "id": 23000153,
                    "name": "SPONGE",
                    "description": "Frank gains +670 health."
                }
            ],
            "gadgets": [
                {
                    "id": 23000261,
                    "name": "ACTIVE NOISE CANCELING",
                    "description": "Frank clears any disabling effect on himself, and momentarily becomes immune to stuns, slows and knockbacks."
                },
                {
                    "id": 23000351,
                    "name": "IRRESISTIBLE ATTRACTION",
                    "description": "Frank's next attack deals an extra 50% damage and pulls opponents towards him."
                }
            ],
            "rarity": {
                "id": 100004,
                "name": "EPIC"
            },
            "attack": {
                "name": "Hammer Hit",
                "description": "Frank takes a while to wind up his hammer blow, but the hit is so hard it sends a shockwave. His attack speed goes up when his health goes down."
            },
            "super": {
                "name": "Stunning Blow",
                "description": "Frank's greatest hit sends a shockwave that destroys environment and stuns enemies for a while."
            },
            "hypercharge": {
                "name": "Seismic Smash",
                "description": "Frank's Super now hits an entire circle around him!"
            },
            "class": {
                "name": "TANK",
                "id": 2011
            },
            "description": "Frank is a good-natured giant who helps out at the mortuary by day and spins tunes at the Club by night. He doesn't get a lot of sleep, and it shows."
        },
        {
            "id": 16000021,
            "name": "GENE",
            "starPowers": [
                {
                    "id": 23000109,
                    "name": "MAGIC PUFFS",
                    "description": "Gene heals all friendly Brawlers around him for 288 health per second."
                },
                {
                    "id": 23000159,
                    "name": "SPIRIT SLAP",
                    "description": "Gene's Magic Hand also damages enemies, dealing 2000 damage on hit."
                }
            ],
            "gadgets": [
                {
                    "id": 23000252,
                    "name": "LAMP BLOWOUT",
                    "description": "All enemies close to Gene are instantly pushed back. If at least one enemy Brawler is within range, Gene will also restore 10% of his max health."
                },
                {
                    "id": 23000352,
                    "name": "VENGEFUL SPIRITS",
                    "description": "Gene shoots a homing missile at all visible opponents within a large area, dealing up to 800 damage based on distance."
                }
            ],
            "rarity": {
                "id": 100005,
                "name": "MYTHIC"
            },
            "attack": {
                "name": "Smoke Blast",
                "description": "Gene shoots a solid ball of magical smoke from his lamp. If the ball doesn't hit a target, it splits up and spreads the damage in a cone."
            },
            "super": {
                "name": "Magic Hand",
                "description": "Gene launches a magical hand from his lamp. If the hand hits an enemy, they get pulled back to Gene's location!"
            },
            "hypercharge": {
                "name": "Hyper Hands",
                "description": "Gene's Super splits into 3 different hands, each being able to grab one enemy. First goes straight, and the other 2 go diagonally."
            },
            "class": {
                "name": "CONTROLLER",
                "id": 2013
            },
            "description": "Most people look at Gene and see a funny little guy in a costume. What they don't see is that his personality is split between his body and his teapot."
        },
        {
            "id": 16000022,
            "name": "TICK",
            "starPowers": [
                {
                    "id": 23000114,
                    "name": "WELL OILED",
                    "description": "When Tick takes no damage and doesn't attack, he starts recovering health 2 seconds faster than normal."
                },
                {
                    "id": 23000161,
                    "name": "AUTOMA-TICK RELOAD",
                    "description": "Tick's reload time is 9% shorter."
                }
            ],
            "gadgets": [
                {
                    "id": 23000253,
                    "name": "MINE MANIA",
                    "description": "Tick's next attack fires 6 mines."
                },
                {
                    "id": 23000355,
                    "name": "LAST HURRAH",
                    "description": "Tick gains a 50% shield for 1.0 seconds. After that, it bursts out for 680 damage."
                }
            ],
            "rarity": {
                "id": 100003,
                "name": "SUPER RARE"
            },
            "attack": {
                "name": "Minimines",
                "description": "Tick lobs a cluster of mines that separate before landing. The mines explode on contact with a target, or after a few seconds."
            },
            "super": {
                "name": "Headfirst",
                "description": "Tick detaches and launches his head. After landing, the head hops toward the nearest target and explodes on contact!"
            },
            "hypercharge": {
                "name": "Headstrong",
                "description": "Tick quickly deploys his head, charging enemies faster and leaving behind 6 of his minimines on explosion."
            },
            "class": {
                "name": "ARTILLERY",
                "id": 2016
            },
            "description": "Tick follows Penny around like a pet as she plots her next big scheme. He isn't good for much besides blowing things up, but that's usually plenty!"
        },
        {
            "id": 16000023,
            "name": "LEON",
            "starPowers": [
                {
                    "id": 23000119,
                    "name": "SMOKE TRAILS",
                    "description": "When Leon uses his Super, he gains a 30% boost to his movement speed for the duration of his invisibility."
                },
                {
                    "id": 23000141,
                    "name": "INVISIHEAL",
                    "description": "Leon recovers 680 health per second while his Super is active."
                }
            ],
            "gadgets": [
                {
                    "id": 23000276,
                    "name": "CLONE PROJECTOR",
                    "description": "Leon creates an illusion of himself to confuse his enemies."
                },
                {
                    "id": 23000408,
                    "name": "LOLLIPOP DROP",
                    "description": "Leon creates a stealthy area for his team to hide in. The lollipop slowly loses its health over time."
                }
            ],
            "rarity": {
                "id": 100006,
                "name": "LEGENDARY"
            },
            "attack": {
                "name": "Spinner Blades",
                "description": "Leon flicks his wrist and fires four Spinner Blades. The blades deal less damage the farther they travel."
            },
            "super": {
                "name": "Smoke Bomb",
                "description": "Leon becomes invisible for 6 seconds. If he attacks, he will be revealed. Enemies close to Leon will be able to spot him."
            },
            "hypercharge": {
                "name": "Limbo",
                "description": "Leon stays invisible while attacking his enemies."
            },
            "class": {
                "name": "ASSASSIN",
                "id": 2015
            },
            "description": "Since Leon doesn't like hanging with other people much, his ability to become invisible comes in handy. Only his little sister, Nita, seems to get through to him."
        },
        {
            "id": 16000024,
            "name": "ROSA",
            "starPowers": [
                {
                    "id": 23000124,
                    "name": "PLANT LIFE",
                    "description": "Rosa recovers 150 health per second when inside a bush."
                },
                {
                    "id": 23000147,
                    "name": "THORNY GLOVES",
                    "description": "Rosa's punches gain +138 damage during her Super."
                }
            ],
            "gadgets": [
                {
                    "id": 23000242,
                    "name": "GROW LIGHT",
                    "description": "Rosa fertilizes the ground around her and bushes instantly grow to provide great cover."
                },
                {
                    "id": 23000348,
                    "name": "UNFRIENDLY BUSHES",
                    "description": "All opponents hiding in bushes take 138 damage and get slowed down for 3 seconds."
                }
            ],
            "rarity": {
                "id": 100002,
                "name": "RARE"
            },
            "attack": {
                "name": "Hands Of Stone",
                "description": "Rosa throws a flurry of powerful punches with perfect technique!"
            },
            "super": {
                "name": "Strong Stuff",
                "description": "Rosa gets a second skin of tough vine for 3 seconds, decreasing all damage received by 70% for the duration."
            },
            "hypercharge": {
                "name": "Grasping Roots",
                "description": "Rosa slows down all nearby enemies while her Super is active."
            },
            "class": {
                "name": "TANK",
                "id": 2011
            },
            "description": "Rosa is a botanist with a strong connection to plants. She's also a boxer, and won't hesitate to punch one of her specimens if it goes out of control!"
        },
        {
            "id": 16000025,
            "name": "CARL",
            "starPowers": [
                {
                    "id": 23000129,
                    "name": "POWER THROW",
                    "description": "Carl throws his Pickaxe with 10% more speed, allowing it to travel and return faster."
                },
                {
                    "id": 23000145,
                    "name": "PROTECTIVE PIROUETTE",
                    "description": "During Carl's Super, all damage he receives is reduced by 35%."
                }
            ],
            "gadgets": [
                {
                    "id": 23000262,
                    "name": "HEAT EJECTOR",
                    "description": "The next pickaxe Carl throws will drop a trail of hot rocks behind it! Opponents that touch them are set on fire and receive 370 damage per second."
                },
                {
                    "id": 23000317,
                    "name": "FLYING HOOK",
                    "description": "Carl's next attack makes his pickaxe pull him to the farthest point of the attack."
                }
            ],
            "rarity": {
                "id": 100003,
                "name": "SUPER RARE"
            },
            "attack": {
                "name": "Pickaxe",
                "description": "Carl throws his Pickaxe like a boomerang. After he catches the returning Pickaxe, he can throw it again."
            },
            "super": {
                "name": "Tailspin",
                "description": "Carl goes into a crazy spin for a few seconds, flailing around and damaging nearby opponents."
            },
            "hypercharge": {
                "name": "Flamespin",
                "description": "Carl gains a flame trail while using his Super. The trail burns on contact, causing damage over time."
            },
            "class": {
                "name": "DAMAGE DEALER",
                "id": 2010
            },
            "description": "Carl is a mining robot who's fascinated by rocks and stones of all kinds. Don't let him get started on his latest obsession: the effects of Gems!"
        },
        {
            "id": 16000026,
            "name": "BIBI",
            "starPowers": [
                {
                    "id": 23000134,
                    "name": "HOME RUN",
                    "description": "Bibi's movement speed is increased by 12% when her Home Run bar is fully charged."
                },
                {
                    "id": 23000146,
                    "name": "BATTING STANCE",
                    "description": "When Bibi's Homerun bar is fully charged, she shields herself from all damage by 20%."
                }
            ],
            "gadgets": [
                {
                    "id": 23000275,
                    "name": "VITAMIN BOOSTER",
                    "description": "Bibi heals 480 health per second for 4 seconds."
                },
                {
                    "id": 23000458,
                    "name": "EXTRA STICKY",
                    "description": "Bibi's next Spitball slows down enemies on hit for 3 seconds!"
                }
            ],
            "rarity": {
                "id": 100004,
                "name": "EPIC"
            },
            "attack": {
                "name": "Three Strikes",
                "description": "Bibi swings her baseball bat. When she has three swings at the ready, her Home Run bar will charge. Once fully charged, her next swing will knock back enemies!"
            },
            "super": {
                "name": "Spitball",
                "description": "Bibi bats a bouncing ball of bubble gum that can go through enemies, and even hit the same target multiple times!"
            },
            "hypercharge": {
                "name": "Out Of Bounds",
                "description": "Bibi's bouncing ball splits when hitting an enemy"
            },
            "class": {
                "name": "TANK",
                "id": 2011
            },
            "description": "Bibi is a tough punk with a baseball bat and an attitude to match. She's a bit of a nerd too, but she'd never show it. She's got an image to maintain!"
        },
        {
            "id": 16000027,
            "name": "8-BIT",
            "starPowers": [
                {
                    "id": 23000168,
                    "name": "BOOSTED BOOSTER",
                    "description": "Increases the Damage Booster's range by 50% and boosts damage by an additional 15%."
                },
                {
                    "id": 23000181,
                    "name": "PLUGGED IN",
                    "description": "When 8-Bit is near his Damage Booster, he will plug in and have increased movement speed."
                }
            ],
            "gadgets": [
                {
                    "id": 23000259,
                    "name": "CHEAT CARTRIDGE",
                    "description": "8-Bit instantly teleports to his Damage Booster."
                },
                {
                    "id": 23000318,
                    "name": "EXTRA CREDITS",
                    "description": "8-Bit's next attack has the number of projectiles increased to 18."
                }
            ],
            "rarity": {
                "id": 100003,
                "name": "SUPER RARE"
            },
            "attack": {
                "name": "Blaster Beams",
                "description": "Shoots a burst of Blaster Beams that damage any opponent they hit. The beams have a slight spread."
            },
            "super": {
                "name": "Damage Booster",
                "description": "Deploys a turret that increases the damage output of all friendly Brawlers in its area of effect."
            },
            "hypercharge": {
                "name": "Aimbot",
                "description": "8-Bit's turret now has a laser that shoots nearby enemies. Shots do 230 damage."
            },
            "class": {
                "name": "DAMAGE DEALER",
                "id": 2010
            },
            "description": "An arcade game famous for its brutal difficulty, 8-Bit always hated its players. Now that it's missing one of its guns, it's angrier than ever before."
        },
        {
            "id": 16000028,
            "name": "SANDY",
            "starPowers": [
                {
                    "id": 23000186,
                    "name": "RUDE SANDS",
                    "description": "Sandstorm now also damages enemies for 108 damage per second."
                },
                {
                    "id": 23000187,
                    "name": "HEALING WINDS",
                    "description": "Sandstorm now also heals friendly Brawlers for 190 health per second."
                }
            ],
            "gadgets": [
                {
                    "id": 23000270,
                    "name": "SLEEP STIMULATOR",
                    "description": "Sandy falls asleep for 1.5 seconds and his health is fully restored."
                },
                {
                    "id": 23000405,
                    "name": "SWEET DREAMS",
                    "description": "Sandy's next attack lulls opponents to sleep for 1.0 seconds. They will, however, wake up from any damage."
                }
            ],
            "rarity": {
                "id": 100006,
                "name": "LEGENDARY"
            },
            "attack": {
                "name": "Pebble Blast",
                "description": "Sandy pelts enemies with sharp, piercing pebbles. Ouch!"
            },
            "super": {
                "name": "Sandstorm",
                "description": "Sandy summons a sandstorm that lasts for 9 seconds and hides friendly Brawlers inside it."
            },
            "hypercharge": {
                "name": "Swift Winds",
                "description": "Sandy grants himself and his allies 20% increased movement speed while inside of Sandstorm. His Super will also silence enemies for 0.5 seconds when it lands."
            },
            "class": {
                "name": "CONTROLLER",
                "id": 2013
            },
            "description": "On the rare occasions Sandy wakes from his slumber, he tries to help his big sister Tara around their store. But it's never long before he falls asleep again."
        },
        {
            "id": 16000029,
            "name": "BEA",
            "starPowers": [
                {
                    "id": 23000192,
                    "name": "INSTA BEALOAD",
                    "description": "Instantly Supercharge Bea's Big Sting one time if she misses a Supercharged shot."
                },
                {
                    "id": 23000193,
                    "name": "HONEYCOMB",
                    "description": "Bea receives a 30% shield while Big Sting is Supercharged."
                }
            ],
            "gadgets": [
                {
                    "id": 23000271,
                    "name": "HONEY MOLASSES",
                    "description": "Bea drops a beehive with a splash of sticky honey around it. The honey slows down enemies that step in it."
                },
                {
                    "id": 23000312,
                    "name": "RATTLED HIVE",
                    "description": "Bea unleashes 4 angry bees that circle away from her, dealing more damage the further they go (up to 600 damage)."
                }
            ],
            "rarity": {
                "id": 100004,
                "name": "EPIC"
            },
            "attack": {
                "name": "Big Sting",
                "description": "Bea sends out a long range shot that, upon landing, Supercharges her next shot to deal epic damage!"
            },
            "super": {
                "name": "Iron Hive",
                "description": "Bea deploys a swarm of drones that move and turn like jets. They slow down any opponents caught in their path."
            },
            "hypercharge": {
                "name": "Protect the Queen",
                "description": "Bea's Super projectiles split into 2 when at max distance (and on hit), increasing her Super's distance and spread even more."
            },
            "class": {
                "name": "MARKSMAN",
                "id": 2012
            },
            "description": "Bea spends her day watching bugs as they go about their lives, imagining what they'd say if she could understand them... or even what it's like to be one."
        },
        {
            "id": 16000030,
            "name": "EMZ",
            "starPowers": [
                {
                    "id": 23000198,
                    "name": "BAD KARMA",
                    "description": "Enemies that stay within the cloud of Emz's toxic hair spray suffer increasing damage, 25% per hit."
                },
                {
                    "id": 23000199,
                    "name": "HYPE",
                    "description": "Emz recovers 288 health per second for each enemy Brawler inside her Super's area of effect."
                }
            ],
            "gadgets": [
                {
                    "id": 23000274,
                    "name": "FRIENDZONER",
                    "description": "Emz pushes back all enemies around her while also dealing 338 damage."
                },
                {
                    "id": 23000459,
                    "name": "ACID SPRAY",
                    "description": "Emz's next blast of hair spray can pass through walls, but deals 10% less damage."
                }
            ],
            "rarity": {
                "id": 100004,
                "name": "EPIC"
            },
            "attack": {
                "name": "Spray",
                "description": "Emz gives you a blast of her hair spray! It's strong enough to melt your face."
            },
            "super": {
                "name": "Caustic Charisma",
                "description": "Emz creates a cloud of toxicity around herself, slowing down the movement of enemies and damaging them."
            },
            "hypercharge": {
                "name": "Overhyped Haze",
                "description": "Emz pushes enemies to the outer edge of her Super on activation and follows up with a dose of her spray."
            },
            "class": {
                "name": "CONTROLLER",
                "id": 2013
            },
            "description": "Emz supposedly works for her uncle Mortis at the mortuary, but she rarely makes an appearance there. She's too busy hawking her hairspray brand online."
        },
        {
            "id": 16000031,
            "name": "MR. P",
            "starPowers": [
                {
                    "id": 23000204,
                    "name": "HANDLE WITH CARE",
                    "description": "Every 4 seconds, the explosion damage of Mr. P's next overstuffed suitcase is increased by 40%."
                },
                {
                    "id": 23000205,
                    "name": "REVOLVING DOOR",
                    "description": "All robo-porters from the home base now have 20% more health and 30% higher damage."
                }
            ],
            "gadgets": [
                {
                    "id": 23000269,
                    "name": "SERVICE BELL",
                    "description": "Mr. P buffs his current porter by increasing its damage by 114 and health by 680."
                },
                {
                    "id": 23000349,
                    "name": "PORTER REINFORCEMENTS",
                    "description": "The next attack will spawn a weak porter where the attack lands."
                }
            ],
            "rarity": {
                "id": 100005,
                "name": "MYTHIC"
            },
            "attack": {
                "name": "Your Suitcase, Sir!",
                "description": "Mr. P throws a heavy suitcase with angry intent. Upon hitting an obstacle or reaching maximum range, the suitcase bounces and lands with a bang, dealing area damage."
            },
            "super": {
                "name": "Porters! Attack",
                "description": "Mr. P deploys the home base for his robo-porters. He has reprogrammed the small penguin-head robots to attack and harass opponents (and unruly guests)."
            },
            "hypercharge": {
                "name": "Super Porters! Assemble!",
                "description": "Mr. P's home base now spawns much stronger porters and he can have two active 'Super Porters' at the same time."
            },
            "class": {
                "name": "CONTROLLER",
                "id": 2013
            },
            "description": "Mr. P is in over his head trying to run a hotel. He's always yelling at his employees to work faster, as if they could understand his gibberish!"
        },
        {
            "id": 16000032,
            "name": "MAX",
            "starPowers": [
                {
                    "id": 23000210,
                    "name": "SUPER CHARGED",
                    "description": "Max now charges her Super while moving."
                },
                {
                    "id": 23000211,
                    "name": "RUN N GUN",
                    "description": "Max reloads faster while moving."
                }
            ],
            "gadgets": [
                {
                    "id": 23000254,
                    "name": "PHASE SHIFTER",
                    "description": "Max dashes forward, and becomes immune to all damage from enemies while dashing."
                },
                {
                    "id": 23000311,
                    "name": "SNEAKY SNEAKERS",
                    "description": "Max blinks back to a place of her choosing after 3 seconds' delay, recovering any damage she received in the meantime."
                }
            ],
            "rarity": {
                "id": 100005,
                "name": "MYTHIC"
            },
            "attack": {
                "name": "Faster Blaster",
                "description": "Max's blaster shoots a bunch of projectiles fast! It holds a lot of rounds, and Max is quick with the reload."
            },
            "super": {
                "name": "let's Go!",
                "description": "Max momentarily boosts up her movement speed and that of nearby allies. Gotta go fast!"
            },
            "hypercharge": {
                "name": "Unlimited Energy",
                "description": "Max throws an energy drink to each team member, increasing their movement speed and granting them 25% Super charge."
            },
            "class": {
                "name": "SUPPORT",
                "id": 2014
            },
            "description": "Fuelled by energy drinks, Max speeds to the scene whenever someone needs help. She never sticks around long enough to do much... but she sure is fast!"
        },
        {
            "id": 16000034,
            "name": "JACKY",
            "starPowers": [
                {
                    "id": 23000222,
                    "name": "COUNTER CRUSH",
                    "description": "When receiving damage, Jacky returns the favor by converting 30% of the damage into a Groundbreaker counterattack."
                },
                {
                    "id": 23000223,
                    "name": "HARDY HARD HAT",
                    "description": "Jacky's Hard Hat protects her by reducing any damage she takes by 20%."
                }
            ],
            "gadgets": [
                {
                    "id": 23000256,
                    "name": "PNEUMATIC BOOSTER",
                    "description": "Jacky gets a burst of energy and moves 25% faster for 4 seconds."
                },
                {
                    "id": 23000486,
                    "name": "REBUILD",
                    "description": "Jacky rebuilds the environment in a small radius around her."
                }
            ],
            "rarity": {
                "id": 100003,
                "name": "SUPER RARE"
            },
            "attack": {
                "name": "Groundbreaker",
                "description": "Jacky hops on her Jackhammer to shake the ground all around. Enemies caught too close will get a pounding!"
            },
            "super": {
                "name": "Holey Moley!",
                "description": "Jacky drills a hole in the ground, pulling in foes to introduce them to her Jackhammer!"
            },
            "hypercharge": {
                "name": "Seismic Event",
                "description": "Holey Moley slows down nearby enemies for 1.5 seconds."
            },
            "class": {
                "name": "TANK",
                "id": 2011
            },
            "description": "Jacky is a miner who can't resist mouthing off about her wild work experiences using very colorful language! Luckily, the bad words are drowned out by the noise of her jackhammer"
        },
        {
            "id": 16000035,
            "name": "GALE",
            "starPowers": [
                {
                    "id": 23000228,
                    "name": "BLUSTERY BLOW",
                    "description": "Gale's Super now stuns enemies for 1.2 seconds if they are pushed against obstacles."
                },
                {
                    "id": 23000229,
                    "name": "FREEZING SNOW",
                    "description": "Gale's snow balls now also slow down opponents for 0.5 seconds."
                }
            ],
            "gadgets": [
                {
                    "id": 23000277,
                    "name": "SPRING EJECTOR",
                    "description": "Gale drops a bounce pad underfoot, launching friend and foe alike into the air."
                },
                {
                    "id": 23000407,
                    "name": "TWISTER",
                    "description": "Gale uses his leaf blower to create a local tornado, which will push away any opponents that try to pass through."
                }
            ],
            "rarity": {
                "id": 100004,
                "name": "EPIC"
            },
            "attack": {
                "name": "Polar Vortex",
                "description": "Gale blasts a large snow ball wall at his enemies!"
            },
            "super": {
                "name": "Gale Force!",
                "description": "Gale delivers an almighty gust of wind and snow, pushing back all enemies caught in its path."
            },
            "hypercharge": {
                "name": "Blizzard",
                "description": "Gale’s Super is slightly wider and fires twice, pushing enemies even further away!"
            },
            "class": {
                "name": "CONTROLLER",
                "id": 2013
            },
            "description": "Gale's job is to use his snowblower to clear the areas around Mr. P's Snowtel. Nobody mentioned anything about stopping when the guests were around..."
        },
        {
            "id": 16000036,
            "name": "NANI",
            "starPowers": [
                {
                    "id": 23000234,
                    "name": "AUTOFOCUS",
                    "description": "Peep deals up to 925 extra damage based on his travel distance."
                },
                {
                    "id": 23000235,
                    "name": "TEMPERED STEEL",
                    "description": "Nani takes 80% less damage while her Super is active."
                }
            ],
            "gadgets": [
                {
                    "id": 23000278,
                    "name": "WARPIN' TIME",
                    "description": "Nani detonates Peep and teleports to his last location."
                },
                {
                    "id": 23000353,
                    "name": "RETURN TO SENDER",
                    "description": "For the next 2 seconds, the first time Nani takes damage from an enemy, 80% of the damage is returned to the enemy."
                }
            ],
            "rarity": {
                "id": 100004,
                "name": "EPIC"
            },
            "attack": {
                "name": "Trigger-Nometry",
                "description": "Nani shoots 3 light orbs that move at different angles and converge towards aimed targets."
            },
            "super": {
                "name": "Manual Override",
                "description": "Nani takes control of Peep and can steer him remotely into enemies, exploding on contact!"
            },
            "hypercharge": {
                "name": "Big Peep",
                "description": "Peep grows in size during travel."
            },
            "class": {
                "name": "MARKSMAN",
                "id": 2012
            },
            "description": "Originally a security camera, Nani was modified to keep an eye on Jessie. Unfortunately, she can hardly keep up with the precocious girl!"
        },
        {
            "id": 16000037,
            "name": "SPROUT",
            "starPowers": [
                {
                    "id": 23000240,
                    "name": "OVERGROWTH",
                    "description": "Every 5 seconds, the next Seed Bomb will explode with a larger explosion radius."
                },
                {
                    "id": 23000241,
                    "name": "PHOTOSYNTHESIS",
                    "description": "Sprout activates a shield, partially protecting itself from all attacks while inside a bush."
                }
            ],
            "gadgets": [
                {
                    "id": 23000244,
                    "name": "GARDEN MULCHER",
                    "description": "Sprout consumes a bush to restore 990 health."
                },
                {
                    "id": 23000315,
                    "name": "TRANSPLANT",
                    "description": "Sprout destroys its current Hedge, but will instantly have its Super fully charged again."
                }
            ],
            "rarity": {
                "id": 100005,
                "name": "MYTHIC"
            },
            "attack": {
                "name": "Seed Bomb",
                "description": "Sprout propels a ball of seeds that bounces around before bursting with a bang! If it makes contact with enemies, it explodes on impact."
            },
            "super": {
                "name": "Hedge",
                "description": "Sprout uses its Super Seed to grow a thick vine hedge, creating an impassable though temporary obstacle."
            },
            "hypercharge": {
                "name": "Thorns",
                "description": "Sprout's vine hedge now damages nearby enemies"
            },
            "class": {
                "name": "ARTILLERY",
                "id": 2016
            },
            "description": "Sprout appears to be a cute gardening robot who helps Rosa around the Biodome, but it's actually an incubator with arms and wheels for a strange pink seed!"
        },
        {
            "id": 16000038,
            "name": "SURGE",
            "starPowers": [
                {
                    "id": 23000283,
                    "name": "TO THE MAX!",
                    "description": "Surge's main attack now splits when hitting walls."
                },
                {
                    "id": 23000284,
                    "name": "SERVE ICE COLD",
                    "description": "Surge keeps his STAGE 1 Super upgrade for the full match duration."
                }
            ],
            "gadgets": [
                {
                    "id": 23000285,
                    "name": "POWER SURGE",
                    "description": "Surge overloads his circuits and increases his upgrade level by 1 for 10 seconds."
                },
                {
                    "id": 23000485,
                    "name": "POWER SHIELD",
                    "description": "Within the next 2 seconds, Surge consumes 50% of the damage of the next incoming hit and uses the energy to reload 2 ammo."
                }
            ],
            "rarity": {
                "id": 100006,
                "name": "LEGENDARY"
            },
            "attack": {
                "name": "Juice Of Justice",
                "description": "Surge serves a shot of Juice that splits in two on contact with enemies."
            },
            "super": {
                "name": "Party Tricks",
                "description": [
                    "With each Super, Surge gets upgraded (MAX 3). Upgrades are lost when Surge is defeated. ",
                    "STAGE 1: Boosted movement speed. ",
                    "STAGE 2: Increased weapon range. ",
                    "STAGE 3: Main attack splits into 6 (instead of 2)."
                ]
            },
            "hypercharge": {
                "name": "Level 5",
                "description": "Surge's shots now ALWAYS split and have increased range!"
            },
            "class": {
                "name": "DAMAGE DEALER",
                "id": 2010
            },
            "description": "Surge is souped-up soda fountain, always ready to get the party started! He's got the beats, the moves, and an endless supply of energy drinks."
        },
        {
            "id": 16000039,
            "name": "COLETTE",
            "starPowers": [
                {
                    "id": 23000300,
                    "name": "PUSH IT",
                    "description": "All enemy Brawlers hit by Colette's charge are carried to the farthest point of the attack!"
                },
                {
                    "id": 23000301,
                    "name": "MASS TAX",
                    "description": "Colette's Super gives her a 20% shield for 5 seconds. Every enemy Brawler hit by it will add 10% more protection."
                }
            ],
            "gadgets": [
                {
                    "id": 23000302,
                    "name": "NA-AH!",
                    "description": "Colette's next shot deals extra 750 damage."
                },
                {
                    "id": 23000457,
                    "name": "GOTCHA!",
                    "description": "On activation, Colette's shots heal herself for 5 seconds for 80% of the damage dealt."
                }
            ],
            "rarity": {
                "id": 100004,
                "name": "EPIC"
            },
            "attack": {
                "name": "Taxing Shot",
                "description": "Colette fires a shot that takes what you owe! And the more you have, the more you owe."
            },
            "super": {
                "name": "Time To Collect",
                "description": "Colette makes a dash forth and back, dealing taxing damage to everyone in her path, based on their maximum health."
            },
            "hypercharge": {
                "name": "Teen Spirit",
                "description": "Colette's spirit follows her during her dash, damaging enemies on the way."
            },
            "class": {
                "name": "DAMAGE DEALER",
                "id": 2010
            },
            "description": "Colette has collected every single figurine, plushie, and toy of every single Brawler. Is she obsessed? Yes. But has she lost touch with reality? Also yes."
        },
        {
            "id": 16000040,
            "name": "AMBER",
            "starPowers": [
                {
                    "id": 23000307,
                    "name": "WILD FLAMES",
                    "description": "Amber can have two fuel puddles on the ground simultaneously and she will recharge her Super automatically when standing near one."
                },
                {
                    "id": 23000308,
                    "name": "SCORCHIN' SIPHON",
                    "description": "While being near a puddle of fire fluid, Amber uses it to reload her firebreathing 50% faster."
                }
            ],
            "gadgets": [
                {
                    "id": 23000309,
                    "name": "FIRE STARTERS",
                    "description": "Amber runs fast for 3 seconds while spilling her fire fluid, which she can then ignite."
                },
                {
                    "id": 23000488,
                    "name": "DANCING FLAMES",
                    "description": "Amber creates 3 orbiting flames around her for 5 seconds, dealing 945 damage on hit."
                }
            ],
            "rarity": {
                "id": 100006,
                "name": "LEGENDARY"
            },
            "attack": {
                "name": "Dragon's Breath",
                "description": "Amber blows a flaming inferno at her opponents. It looks awesome, but watch out or you'll get seared!"
            },
            "super": {
                "name": "Torch 'Em!",
                "description": "Amber throws a flask of her fire fluid that she can then light up with her firebreathing. Bushes and opposing Brawlers will be toast! (One flask at a time!)"
            },
            "hypercharge": {
                "name": "Oil Spill",
                "description": "Super's oil spill area is increased. Oil keeps burning for 3 seconds after being lit on fire."
            },
            "class": {
                "name": "CONTROLLER",
                "id": 2013
            },
            "description": "Amber brings the heat, literally! She's overconfident about her fire abilities despite being a bit of a klutz. With her, it's spectacle first, and safety last."
        },
        {
            "id": 16000041,
            "name": "LOU",
            "starPowers": [
                {
                    "id": 23000324,
                    "name": "SUPERCOOL",
                    "description": "Opponents standing on Lou's Super area get frozen 33% faster."
                },
                {
                    "id": 23000325,
                    "name": "HYPOTHERMIA",
                    "description": "Opponents lose up to 50% of their damage based on how frozen they are from Lou's attacks."
                }
            ],
            "gadgets": [
                {
                    "id": 23000326,
                    "name": "ICE BLOCK",
                    "description": "Lou shields himself with ice, becoming invulnerable for 1.0 seconds."
                },
                {
                    "id": 23000400,
                    "name": "CRYO SYRUP",
                    "description": "Instantly adds 50% freeze meter to opponents inside Lou's Super."
                }
            ],
            "rarity": {
                "id": 100005,
                "name": "MYTHIC"
            },
            "attack": {
                "name": "Brain Freeze",
                "description": "Barraging opponents with snow cones, Lou can eventually freeze them in place for 1.5 seconds."
            },
            "super": {
                "name": "Can-Do",
                "description": "Lou lobs a can of freezing cold syrup that creates an icy, slippery area on the ground that also slowly freezes enemies. Very tough for his opponents' fancy footwork!"
            },
            "hypercharge": {
                "name": "Slushie Storm",
                "description": "Lou's Super instantly freezes enemies in the area."
            },
            "class": {
                "name": "CONTROLLER",
                "id": 2013
            },
            "description": "Lou is a robot snow cone salesman who's yet to make his first sale. Being located on a snowy mountain peak might have something to do with that."
        },
        {
            "id": 16000042,
            "name": "BYRON",
            "starPowers": [
                {
                    "id": 23000331,
                    "name": "MALAISE",
                    "description": "Byron's Super will also cause opponents to receive 75% less healing from any source for 9 seconds."
                },
                {
                    "id": 23000332,
                    "name": "INJECTION",
                    "description": "Every 3.5 seconds the next basic attack will pierce through targets."
                }
            ],
            "gadgets": [
                {
                    "id": 23000333,
                    "name": "SHOT IN THE ARM",
                    "description": "Byron uses one of his shots to heal himself 597 per second for 3 seconds."
                },
                {
                    "id": 23000461,
                    "name": "BOOSTER SHOTS",
                    "description": "Byron's next attack shoots 3 darts instead of one, each dealing 20% less damage and 40% less healing."
                }
            ],
            "rarity": {
                "id": 100005,
                "name": "MYTHIC"
            },
            "attack": {
                "name": "Careful Dose",
                "description": "Shoots a long range dart that can hit both opponents and friendlies. Opponents will take damage over time and friendlies will heal over time."
            },
            "super": {
                "name": "Full Treatment",
                "description": "Throws a vial that heals friendlies and damages opponents."
            },
            "hypercharge": {
                "name": "Unstable Concoction",
                "description": "Byron's Super also fires his main attack in all directions from the point of impact."
            },
            "class": {
                "name": "SUPPORT",
                "id": 2014
            },
            "description": "Byron has invented many concoctions and tinctures that heal or harm in various ways.... but most of them fall into the harming category"
        },
        {
            "id": 16000043,
            "name": "EDGAR",
            "starPowers": [
                {
                    "id": 23000338,
                    "name": "HARD LANDING",
                    "description": "Edgar's Super will also deal 675 damage to nearby enemies upon landing."
                },
                {
                    "id": 23000339,
                    "name": "FISTICUFFS",
                    "description": "Edgar receives 25% more healing from damage he deals."
                }
            ],
            "gadgets": [
                {
                    "id": 23000340,
                    "name": "LET'S FLY",
                    "description": "Edgar's Super charges faster, 525% for 4 seconds."
                },
                {
                    "id": 23000403,
                    "name": "HARDCORE",
                    "description": "Edgar gets a shield that protects him from the next 1650 damage. The shield gets weaker over time."
                }
            ],
            "rarity": {
                "id": 100004,
                "name": "EPIC"
            },
            "attack": {
                "name": "Fight Club",
                "description": "Hits enemies with quick punches, healing himself for each landed punch."
            },
            "super": {
                "name": "Vault",
                "description": "Edgar jumps over any obstacle and gets a temporary speed boost. His Super will slowly charge over time."
            },
            "hypercharge": {
                "name": "Outburst",
                "description": "After using Super gain charging speed and reload speed for few seconds."
            },
            "class": {
                "name": "ASSASSIN",
                "id": 2015
            },
            "description": "Edgar believes nobody understands him. Certainly not his mom, who thinks he's going through a phase. Only he knows the darkness in his soul is eternal."
        },
        {
            "id": 16000044,
            "name": "RUFFS",
            "starPowers": [
                {
                    "id": 23000345,
                    "name": "AIR SUPERIORITY",
                    "description": "Supply Drop now includes a bomb that adds 120% more damage to the drop and also allows it to destroy walls."
                },
                {
                    "id": 23000346,
                    "name": "FIELD PROMOTION",
                    "description": "Friendly Brawlers have their maximum health increased by 45 every second that they are in range of this ability while it's active."
                }
            ],
            "gadgets": [
                {
                    "id": 23000347,
                    "name": "TAKE COVER",
                    "description": "Ruffs throws down 3 sandbags as cover. Each one has 35% of Ruffs' max health."
                },
                {
                    "id": 23000402,
                    "name": "AIR SUPPORT",
                    "description": "Ruffs calls a barrage around the nearest opponent, dealing 960 damage with each hit."
                }
            ],
            "rarity": {
                "id": 100005,
                "name": "MYTHIC"
            },
            "attack": {
                "name": "Double-Barrel Laser",
                "description": "Ruffs' twin-laser bounces off walls multiple times. They can hit opponents behind cover."
            },
            "super": {
                "name": "Suppy Drop",
                "description": "Ruffs calls down a supply drop that damages any opponent it hits, and leaves a power-up for friendly Brawlers to pick up. The power-up increases health and damage. Multiple power-ups do not stack, and you lose the power-up if defeated."
            },
            "hypercharge": {
                "name": "The Goodest Boy",
                "description": "Ruffs's Super deals 25% more damage and his power-up fully charges a Hypercharge."
            },
            "class": {
                "name": "SUPPORT",
                "id": 2014
            },
            "description": "Ruffs is a loyal, highly disciplined space colonel who runs a tight ship and does everything by the book. But deep down, he just wants to be a good boy!"
        },
        {
            "id": 16000045,
            "name": "STU",
            "starPowers": [
                {
                    "id": 23000362,
                    "name": "ZERO DRAG",
                    "description": "Stu's Nitro Boost Super dash distance increases by 71%."
                },
                {
                    "id": 23000363,
                    "name": "GASO-HEAL",
                    "description": "Using his Nitro Boost Super restores 256 of Stu's health."
                }
            ],
            "gadgets": [
                {
                    "id": 23000364,
                    "name": "SPEED ZONE",
                    "description": "Stu drops a booster that makes himself, his teammates and other allies move faster while inside its area of effect."
                },
                {
                    "id": 23000401,
                    "name": "BREAKTHROUGH",
                    "description": "Stu's next Super can bash through obstacles, making debris fly forward. Each piece of debris deals 108 damage to any opponent it hits."
                }
            ],
            "rarity": {
                "id": 100004,
                "name": "EPIC"
            },
            "attack": {
                "name": "Razzle Dazzle",
                "description": "Stu fires out two pyrotechnic shots that pack quite a wallop."
            },
            "super": {
                "name": "Nitro Boost",
                "description": "Hitting an opponent with Razzle Dazzle charges up Stu's Nitro Boost, a short dash that leaves a trail of burning rubber on the ground. The trail will set fire to any opponents that touch it."
            },
            "hypercharge": {
                "name": "Infinitro",
                "description": "Stu's Super can be used continuously while Hypercharged."
            },
            "class": {
                "name": "ASSASSIN",
                "id": 2015
            },
            "description": "A little punch-drunk from too many bumps, bruises, and gasoline fumes over his long stunt performing career, Stu is a bit wobbly on his wheel these days."
        },
        {
            "id": 16000046,
            "name": "BELLE",
            "starPowers": [
                {
                    "id": 23000369,
                    "name": "POSITIVE FEEDBACK",
                    "description": "Belle gains a 20% shield whenever her Electro-Bolts hit a target."
                },
                {
                    "id": 23000370,
                    "name": "GROUNDED",
                    "description": "Getting marked by Belle's Super prevents the opponent from reloading their attack for 5 seconds."
                }
            ],
            "gadgets": [
                {
                    "id": 23000371,
                    "name": "NEST EGG",
                    "description": "Belle places a trap on the ground that will explode when triggered by an opponent. The trap deals 312 damage, and slows down anyone within its blast radius for 3 seconds."
                },
                {
                    "id": 23000463,
                    "name": "REVERSE POLARITY",
                    "description": "Belle's next Electro-Bolt bounces from walls."
                }
            ],
            "rarity": {
                "id": 100004,
                "name": "EPIC"
            },
            "attack": {
                "name": "Shocker",
                "description": "Belle shoots a long range Electro-Bolt, dealing damage to any target hit. After a short delay, the bolt will jump to any nearby target, deal damage and jump to the next one."
            },
            "super": {
                "name": "Spotter",
                "description": "Belle fires a spotting shot that marks any opponent it hits. The marked opponent takes extra damage from any source. Only one target can be marked at a time."
            },
            "hypercharge": {
                "name": "Magnetic",
                "description": "Belle's spotting shot automatically follows the closest target"
            },
            "class": {
                "name": "MARKSMAN",
                "id": 2012
            },
            "description": "The leader of the notorious Goldarm Gang, Belle is after more than money. She wants to find out the truth behind Starr Park and bring it down!"
        },
        {
            "id": 16000047,
            "name": "SQUEAK",
            "starPowers": [
                {
                    "id": 23000376,
                    "name": "CHAIN REACTION",
                    "description": "Each opponent within the area of a Sticky Blomb's explosion increases the Blomb's damage by 15%."
                },
                {
                    "id": 23000377,
                    "name": "SUPER STICKY",
                    "description": "Secondary Sticky Blomb explosions from Squeak's Super also slow down opponents for 4 seconds."
                }
            ],
            "gadgets": [
                {
                    "id": 23000378,
                    "name": "WINDUP",
                    "description": "Squeak's next Sticky Blomb deals 50% more damage and has 100% longer range."
                },
                {
                    "id": 23000462,
                    "name": "RESIDUE",
                    "description": "Squeak's next Sticky Blomb leaves a residue area behind after exploding, slowing down enemies and giving allies sight into bushes for 6 seconds."
                }
            ],
            "rarity": {
                "id": 100005,
                "name": "MYTHIC"
            },
            "attack": {
                "name": "Stick Blomb",
                "description": "Squeak's sticky blobs of goo are unstable, and blow up with a big splash and an ouch! They attach to any opponent they hit outright."
            },
            "super": {
                "name": "Big Blob",
                "description": "Squeak lobs a blob that blows up with aplomb! The explosion of goo sends six smaller Sticky Blombs in all directions."
            },
            "hypercharge": {
                "name": "Bouncy Blob",
                "description": "The Sticky Blombs from Squeak's Super now bounce and split one more time."
            },
            "class": {
                "name": "CONTROLLER",
                "id": 2013
            },
            "description": "Squeak is a blob of happy energy who loves his creator, Ruffs. He's a joy to be around, at least if you are unaware that he's made of dog slobber"
        },
        {
            "id": 16000048,
            "name": "GROM",
            "starPowers": [
                {
                    "id": 23000383,
                    "name": "FOOT PATROL",
                    "description": "When Grom's Super is fully charged, he gains +15% faster movement speed!"
                },
                {
                    "id": 23000384,
                    "name": "X-FACTOR",
                    "description": "The split from Grom's main attack deals up to +30% extra damage at max distance."
                }
            ],
            "gadgets": [
                {
                    "id": 23000385,
                    "name": "WATCHTOWER",
                    "description": "Grom ejects a Watchtower from his Grom Bomb that gives all allies sight into bushes over a large area. The watchtower slowly loses health over time."
                },
                {
                    "id": 23000460,
                    "name": "RADIO CHECK",
                    "description": "Grom's next attack throws 3 Buds in rapid succession."
                }
            ],
            "rarity": {
                "id": 100004,
                "name": "EPIC"
            },
            "attack": {
                "name": "Bud Go Boom!",
                "description": "Grom hurls Bud, his exploding walkie-talkie! The blast moves in the shape of a cross, hurting enemies caught in its path."
            },
            "super": {
                "name": "Grom Bomb",
                "description": "Grom launches a devastating bomb with Bud's help! The Grom Bomb inflicts huge damage, breaks walls and the force from its blast pushes all enemies backwards."
            },
            "hypercharge": {
                "name": "Grom Bomb Goes Boom!",
                "description": "Grom’s Super gains a secondary explosion after the first, in an X-pattern. This explosion also deals damage, breaks walls, and knocks enemies back."
            },
            "class": {
                "name": "ARTILLERY",
                "id": 2016
            },
            "description": "Grom is a brawny security guard with one weak point: the flashbacks he gets from his time working at a kindergarten. Those kids were merciless."
        },
        {
            "id": 16000049,
            "name": "BUZZ",
            "starPowers": [
                {
                    "id": 23000390,
                    "name": "TOUGHER TORPEDO",
                    "description": "The minimum duration of Buzz's Super stun is increased by 0.5 seconds."
                },
                {
                    "id": 23000391,
                    "name": "EYES SHARP",
                    "description": "Buzz's Super charging area is increased by 33%."
                }
            ],
            "gadgets": [
                {
                    "id": 23000392,
                    "name": "RESERVE BUOY",
                    "description": "Instantly fills the Super meter, but the next Torpedo Throw doesn't stun opponents."
                },
                {
                    "id": 23000490,
                    "name": "X-RAY-SHADES",
                    "description": "Buzz can see into all bushes in his Super charging area for 12 seconds."
                }
            ],
            "rarity": {
                "id": 100005,
                "name": "MYTHIC"
            },
            "attack": {
                "name": "Buzz Off",
                "description": "Buzz blows on his lifeguard whistle, piercing nearby ears five times in an arc."
            },
            "super": {
                "name": "Torpedo Throw",
                "description": "Buzz throws out his torpedo buoy. If it hits an opponent or a wall, Buzz hauls himself over there, stunning nearby opponents where he lands. The stun time increases based on distance travelled."
            },
            "hypercharge": {
                "name": "Buzzwatch",
                "description": "Buzz can throw his torpedo multiple times in a row"
            },
            "class": {
                "name": "ASSASSIN",
                "id": 2015
            },
            "description": "Buzz is a lifeguard at the Velocirapids water park and a real stickler for the rules. He clearly enjoys wielding the tiny bit of authority he has to the greatest degree possible."
        },
        {
            "id": 16000050,
            "name": "GRIFF",
            "starPowers": [
                {
                    "id": 23000397,
                    "name": "KEEP THE CHANGE",
                    "description": "Furious Griff tosses coins faster, reducing the time for a full salvo by 25%."
                },
                {
                    "id": 23000398,
                    "name": "BUSINESS RESILIENCE",
                    "description": "Every 2 seconds, Griff regains up to 15% of his missing health."
                }
            ],
            "gadgets": [
                {
                    "id": 23000399,
                    "name": "PIGGY BANK",
                    "description": "Griff drops a firecracker-filled piggy bank that explodes after a short delay, destroying obstacles and dealing 700 damage to opponents within range."
                },
                {
                    "id": 23000487,
                    "name": "COIN SHOWER",
                    "description": "Griff's next Coin Toss shoots 33% more coins."
                }
            ],
            "rarity": {
                "id": 100004,
                "name": "EPIC"
            },
            "attack": {
                "name": "Coin Toss",
                "description": "Angry Griff pelts opponents with coins. He throws three salvos that spread out in a cone."
            },
            "super": {
                "name": "Cashback",
                "description": "Griff throws a bunch of sharp-edged banknotes in a wide cone. Too valuable to just give away, they return to him, and may cause paper cuts twice to the same target. Opponents further away take more damage."
            },
            "hypercharge": {
                "name": "Tax Debate",
                "description": "Griff's banknotes multiply at max range before returning, with the newly created banknotes returning after a delay. They also pierce the environment."
            },
            "class": {
                "name": "CONTROLLER",
                "id": 2013
            },
            "description": "Griff acts like a rich, successful entrepreneur, but his only business is the failing Starr Park Gift Shop. Oddly, he's never around when the bank calls."
        },
        {
            "id": 16000051,
            "name": "ASH",
            "starPowers": [
                {
                    "id": 23000414,
                    "name": "FIRST BASH",
                    "description": "When hitting an opponent with his attack charges full, Ash gets even more angry. His Rage goes up by 200%."
                },
                {
                    "id": 23000415,
                    "name": "MAD AS HECK",
                    "description": "Ash progressively gains up to 40% faster reload speed, equal to how enraged he's become."
                }
            ],
            "gadgets": [
                {
                    "id": 23000416,
                    "name": "CHILL PILL",
                    "description": "Though furious, Ash has to collect himself. A full Rage meter will recover 1620 health when this gadget is popped - less Rage, less recovery."
                },
                {
                    "id": 23000465,
                    "name": "ROTTEN BANANA",
                    "description": "Ash loses 10% health and instantly gains 40% rage."
                }
            ],
            "rarity": {
                "id": 100004,
                "name": "EPIC"
            },
            "attack": {
                "name": "Clean-Up",
                "description": "Ash angrily smashes down with his broom. Get out of the way or you might bite the dust!"
            },
            "super": {
                "name": "Little Helpers",
                "description": "Robotic rats for cleaning up? That's right, they explode on contact, dealing damage to opponents and greatly increasing Ash's Rage level."
            },
            "hypercharge": {
                "name": "Rat King",
                "description": "Little Helper spawns 5 more rats!"
            },
            "class": {
                "name": "TANK",
                "id": 2011
            },
            "description": "Ash has the thankless job of keeping the park clean. He's climbed into a trash can to protect himself from broken glass and rat bites. It makes him grumpy!"
        },
        {
            "id": 16000052,
            "name": "MEG",
            "starPowers": [
                {
                    "id": 23000421,
                    "name": "FORCE FIELD",
                    "description": "Meg is protected by a 25% shield for 10 seconds when her Mecha is destroyed."
                },
                {
                    "id": 23000422,
                    "name": "HEAVY METAL",
                    "description": "Upon expiring, the Mecha suit explodes, dealing 1200 damage to nearby opponents and pushing them away."
                }
            ],
            "gadgets": [
                {
                    "id": 23000423,
                    "name": "JOLTING VOLTS",
                    "description": "Heal the Mecha by 259 health per second for 5 seconds."
                },
                {
                    "id": 23000489,
                    "name": "TOOLBOX",
                    "description": "Meg drops her toolbox, which increases the reload speed for nearby allies by 35% until it gets destroyed."
                }
            ],
            "rarity": {
                "id": 100006,
                "name": "LEGENDARY"
            },
            "description": "Content to work behind the scenes with her trusty mecha suit, Meg takes care of real problems, while Max and Surge are out entertaining the crowds.",
            "forms": [
                {
                    "formName": "Meg",
                    "attack": {
                        "name": "Target Acquired",
                        "description": "Meg fires a short burst from her blaster that pokes at her enemies' patience."
                    },
                    "super": {
                        "name": "Mega Machina",
                        "description": "Meg jumps into her Mecha suit for some colossal carnage!"
                    }
                },
                {
                    "formName": "Mecha",
                    "attack": {
                        "name": "Crowd Control",
                        "description": "A strong barrage of bullets that leaves nothing to chance. It's the quickest way to make crowds disperse!"
                    },
                    "super": {
                        "name": "Feel the Steel",
                        "description": "The Mecha swings a formidable forearm that enemies will see and feel."
                    }
                }
            ],
            "hypercharge": {
                "name": "Tungsten Toughness",
                "description": "Meg's Mecha has an increased swipe range when activating it's Super. While out of the Mecha, Meg pops a defensive shield for protection."
            },
            "class": {
                "name": "TANK",
                "id": 1011
            },
            "attack": {
                "name": "",
                "description": ""
            },
            "super": {
                "name": "",
                "description": ""
            }
        },
        {
            "id": 16000053,
            "name": "LOLA",
            "starPowers": [
                {
                    "id": 23000431,
                    "name": "IMPROVISE",
                    "description": "When down to her last round, Lola deals an extra 30% damage."
                },
                {
                    "id": 23000432,
                    "name": "SEALED WITH A KISS",
                    "description": "Projectiles from Lola's Ego will heal allies that are caught in its path by 112 health."
                }
            ],
            "gadgets": [
                {
                    "id": 23000433,
                    "name": "FREEZE FRAME",
                    "description": "Lola's Ego stops moving to strike a pose! Gaining a 50% shield for 4 seconds."
                },
                {
                    "id": 23000456,
                    "name": "STUNT DOUBLE",
                    "description": "Lola and her Ego switch locations. She recovers 760 health."
                }
            ],
            "rarity": {
                "id": 100004,
                "name": "EPIC"
            },
            "attack": {
                "name": "Diamond Eyes",
                "description": "Lola's favorite accessory is also her favorite weapon! It shoots from the eyes in short bursts and with plenty of panache."
            },
            "super": {
                "name": "Megalomaniac",
                "description": "Lola releases her Ego that mimics her every move. If it's too close to Lola though, it will deal less damage."
            },
            "hypercharge": {
                "name": "Inflated Ego",
                "description": "Spawns a mega inflated Ego with increased health and damage!"
            },
            "class": {
                "name": "DAMAGE DEALER",
                "id": 2010
            },
            "description": "Lola makes sure everyone knows when she enters a room. She's an expert in the fine art of causing a scene to get what she wants, and she's proud of it!"
        },
        {
            "id": 16000054,
            "name": "FANG",
            "starPowers": [
                {
                    "id": 23000438,
                    "name": "FRESH KICKS",
                    "description": "When Fang defeats an enemy Brawler with his Super, it's recharged instantly, allowing him to use his Super again!"
                },
                {
                    "id": 23000439,
                    "name": "DIVINE SOLES",
                    "description": "Reduce 344 damage from incoming hits once every 3 seconds. Maximum reduction is 90% of the incoming damage."
                }
            ],
            "gadgets": [
                {
                    "id": 23000440,
                    "name": "CORN-FU",
                    "description": "Fang tosses a handful of corn kernels into the air, making it rain popcorn! Each kernel pop deals 544 damage."
                },
                {
                    "id": 23000464,
                    "name": "ROUNDHOUSE KICK",
                    "description": "Fang spins and hits all enemies around him, stunning them for 0.5 seconds."
                }
            ],
            "rarity": {
                "id": 100005,
                "name": "MYTHIC"
            },
            "attack": {
                "name": "Wu-Shoe",
                "description": "Fang unleashes a swift kick with a hidden trick. If the kick misses the target, his shoe will fly off his foot!"
            },
            "super": {
                "name": "Sneak Ahead",
                "description": "Fang flies into a nasty kick that, upon contact, can chain a further 3 consecutive kicks to nearby enemies."
            },
            "hypercharge": {
                "name": "Dragon Kick",
                "description": "Charge through walls while dropping popcorn on the way."
            },
            "class": {
                "name": "ASSASSIN",
                "id": 2015
            },
            "description": "Fang has absorbed so many kung-fu movies he practically lives in one. He's confident, charming, and never uses his hands if he can kick instead!"
        },
        {
            "id": 16000056,
            "name": "EVE",
            "starPowers": [
                {
                    "id": 23000452,
                    "name": "UNNATURAL ORDER",
                    "description": "Reverses the order of the eggs shot by her Egg Shooter."
                },
                {
                    "id": 23000453,
                    "name": "HAPPY SURPRISE",
                    "description": "Every 5 seconds, the next largest egg hitting an enemy of her Egg Shooter will spawn a hatchling."
                }
            ],
            "gadgets": [
                {
                    "id": 23000454,
                    "name": "GOTTA GO!",
                    "description": "Eve jumps away and leaves behind a hatchling."
                },
                {
                    "id": 23000455,
                    "name": "MOTHERLY LOVE",
                    "description": "Hatchlings spawned from an active big egg will now heal allies over time instead of dealing damage."
                }
            ],
            "rarity": {
                "id": 100005,
                "name": "MYTHIC"
            },
            "attack": {
                "name": "Egg Shooter",
                "description": "Eve shoots three eggs in a row, with each one being bigger and dealing more damage than the previous egg."
            },
            "super": {
                "name": "Baby Boom",
                "description": "Eve releases a big egg, which incubates a group of hatchlings. Hatchlings attach to enemies and deal damage over time."
            },
            "hypercharge": {
                "name": "Generations",
                "description": "Baby boom now spawns hatchlings over time!"
            },
            "class": {
                "name": "DAMAGE DEALER",
                "id": 2010
            },
            "description": "Eve's purpose in life is to mother and protect her precious babies! She'll do whatever it takes to find them a good home... preferably in Ruffs' fur"
        },
        {
            "id": 16000057,
            "name": "JANET",
            "starPowers": [
                {
                    "id": 23000470,
                    "name": "STAGE VIEW",
                    "description": "While in the air with her jetpack, Janet reveals a large area of bushes around herself."
                },
                {
                    "id": 23000471,
                    "name": "VOCAL WARM UP",
                    "description": "Janet's attack focuses 30% faster."
                }
            ],
            "gadgets": [
                {
                    "id": 23000472,
                    "name": "DROP THE BASS",
                    "description": "Janet deploys a speaker that deals 100 damage per second to all enemies in the area until it gets destroyed."
                },
                {
                    "id": 23000473,
                    "name": "BACKSTAGE PASS",
                    "description": "Janet's next High Note pushes her back, even over walls. The more focused her attack is, the further she'll be pushed back."
                }
            ],
            "rarity": {
                "id": 100005,
                "name": "MYTHIC"
            },
            "attack": {
                "name": "High Note",
                "description": "Janet sings a loud note. The longer she holds the note, the more focused it will become and the farther it will fly."
            },
            "super": {
                "name": "Crescendo",
                "description": "Janet uses her jetpack to take to the skies for a moment, where she attacks opponents from above for the full duration."
            },
            "hypercharge": {
                "name": "Magnum Opus",
                "description": "Janet retains full movement control during her Super."
            },
            "class": {
                "name": "MARKSMAN",
                "id": 2012
            },
            "description": "Janet will do whatever it takes to reach the top! As a bonus, her performing skills come in handy for rescuing her sister Bonnie, whenever she gets into trouble."
        },
        {
            "id": 16000058,
            "name": "BONNIE",
            "starPowers": [
                {
                    "id": 23000478,
                    "name": "BLACK POWDER",
                    "description": "The range of Bonnie's Star Launcher is increased by 36%."
                },
                {
                    "id": 23000479,
                    "name": "WISDOM TOOTH",
                    "description": "Loose Tooth shatters on hit, dealing 25% extra damage to nearby enemies."
                }
            ],
            "gadgets": [
                {
                    "id": 23000480,
                    "name": "SUGAR RUSH",
                    "description": "Clyde's movement and reload speed are increased by 30% for 5 seconds."
                },
                {
                    "id": 23000481,
                    "name": "CRASH TEST",
                    "description": "Bonnie dashes forward, knocking back enemies and dealing 1160 damage on hit."
                }
            ],
            "rarity": {
                "id": 100004,
                "name": "EPIC"
            },
            "description": "Bonnie is a bundle of uncontrollable and totally destructive energy. Her dream is to be fired from her cannon, all the way to the moon!",
            "forms": [
                {
                    "formName": "Clyde (Cannon)",
                    "attack": {
                        "name": "Loose Tooth",
                        "description": "Bonnie shoots a HUGE tooth from Clyde towards her enemies."
                    },
                    "super": {
                        "name": "Star Launcher",
                        "description": "Clyde launches Bonnie into the air. She can fly over obstacles and deals damage to nearby enemies on landing."
                    }
                },
                {
                    "formName": "Bonnie",
                    "attack": {
                        "name": "Bomber Jacket",
                        "description": "Bonnie flings a cluster of small grenades from her sleeves."
                    },
                    "super": {
                        "name": "Clyde",
                        "description": "Bonnie calls Clyde and jumps into it, taking control of the cannon."
                    }
                }
            ],
            "hypercharge": {
                "name": "Daredevil",
                "description": "Bonnie stuns enemies for 1 sec when firing and landing from Clyde, plus she spits damage dealing teeth around her."
            },
            "class": {
                "name": "MARKSMAN",
                "id": "2012"
            },
            "attack": {
                "name": "",
                "description": ""
            },
            "super": {
                "name": "",
                "description": ""
            }
        },
        {
            "id": 16000059,
            "name": "OTIS",
            "starPowers": [
                {
                    "id": 23000495,
                    "name": "STENCIL GLUE",
                    "description": "Cil mightily squeezes the enemy with all his might. Preventing them from attacking for 33% longer."
                },
                {
                    "id": 23000496,
                    "name": "INK REFILLS",
                    "description": "Otis now shoots 33% more ink drops."
                }
            ],
            "gadgets": [
                {
                    "id": 23000497,
                    "name": "DORMANT STAR",
                    "description": "The next starfish will stay on the ground if an enemy is not hit, laying dormant until an enemy gets close."
                },
                {
                    "id": 23000498,
                    "name": "PHAT SPLATTER",
                    "description": "Otis's next attack shoots a giant ink ball that leaves a puddle, dealing 575 damage over time for 3.8 seconds."
                }
            ],
            "rarity": {
                "id": 100005,
                "name": "MYTHIC"
            },
            "attack": {
                "name": "Inky Art",
                "description": "Otis squirts a burst of ink drops from his spray gun arm."
            },
            "super": {
                "name": "Silent Seabed",
                "description": "Otis flings Cil who grabs onto the first enemy hit and prevents them from attacking for a short while."
            },
            "hypercharge": {
                "name": "Silent Stunner",
                "description": "Otis's Super now also stuns for 1.5 seconds on impact."
            },
            "class": {
                "name": "CONTROLLER",
                "id": 2013
            },
            "description": "Otis is a young street artist on the come-up who works by shooting ink at the walls. Nobody knows his true identity, which only adds to his mystique!"
        },
        {
            "id": 16000060,
            "name": "SAM",
            "starPowers": [
                {
                    "id": 23000503,
                    "name": "HEARTY RECOVERY",
                    "description": "Upon recalling his Knuckle Busters, Sam instantly recovers 20% of his missing health."
                },
                {
                    "id": 23000504,
                    "name": "REMOTE RECHARGE",
                    "description": "While the Knuckle Busters are on the ground and near enemies, they will charge up Sam's Super."
                }
            ],
            "gadgets": [
                {
                    "id": 23000505,
                    "name": "MAGNETIC FIELD",
                    "description": "While the Knuckle Busters are on the ground, Sam can activate them to pull in nearby enemies."
                },
                {
                    "id": 23000506,
                    "name": "PULSE REPELLENT",
                    "description": "Upon landing on the ground, Sam's next deployed Knuckle Busters releases an electric pulse that knocks back enemies."
                }
            ],
            "rarity": {
                "id": 100004,
                "name": "EPIC"
            },
            "attack": {
                "name": "Heavy Haymakers",
                "description": "Sam unleashes a double dose of hard-hitting punches. With his gloves on, he deals a lot more damage."
            },
            "super": {
                "name": "Knuckle Busters",
                "description": "Sam throws his Knuckle Busters, dealing damage to all enemies hit, before landing on the ground. His next Super will return them back to his hands and also deals damage."
            },
            "hypercharge": {
                "name": "Hyper Fist",
                "description": "Sam’s Knuckle Busters travel faster and will fully charge his Super if they hit an enemy Brawler during the Hypercharge."
            },
            "class": {
                "name": "ASSASSIN",
                "id": 2015
            },
            "description": "A former factory worker turned wanted member of the Goldarm Gang, Sam is always there to ensure Belle doesn't go too far on their latest heist!"
        },
        {
            "id": 16000061,
            "name": "GUS",
            "starPowers": [
                {
                    "id": 23000511,
                    "name": "HEALTH BONANZA",
                    "description": "Healing gained from spirits are increased by 100%."
                },
                {
                    "id": 23000512,
                    "name": "SPIRIT ANIMAL",
                    "description": "Spooky increases the damage of a teammate by 25% for 5 seconds."
                }
            ],
            "gadgets": [
                {
                    "id": 23000513,
                    "name": "KOOKY POPPER",
                    "description": "Explode all uncollected spirits, dealing 1080 damage to nearby enemies."
                },
                {
                    "id": 23000514,
                    "name": "SOUL SWITCHER",
                    "description": "Gus loses 5% health but gains 100% spirit instantly."
                }
            ],
            "rarity": {
                "id": 100003,
                "name": "SUPER RARE"
            },
            "attack": {
                "name": "Loony Balloons",
                "description": "Gus shoots balloons at enemies. After several hits, a spirit will drop. Collected spirits will restore some health to Gus or his teammates."
            },
            "super": {
                "name": "Spooky Boy",
                "description": "Gus uses Spooky (a balloon creation and also his best friend), to create a shield around himself or one of his teammates and pushes nearby enemies back."
            },
            "hypercharge": {
                "name": "Generations",
                "description": "Baby boom now spawns hatchlings over time!"
            },
            "class": {
                "name": "SUPPORT",
                "id": 2014
            },
            "description": "Gus looks so much like a ghost child that he's often mistaken for one. Perhaps fittingly, he's an enthusiast of all things Supernatural, since he's too innocent to be scared."
        },
        {
            "id": 16000062,
            "name": "BUSTER",
            "starPowers": [
                {
                    "id": 23000519,
                    "name": "BLOCKBUSTER",
                    "description": "Buster's Lens Flare deals 15% more damage for each ally in his Super's charge area."
                },
                {
                    "id": 23000520,
                    "name": "KEVLAR VEST",
                    "description": "While Montage is active Buster takes 10% less damage and is immune to knockbacks, slows and stuns."
                }
            ],
            "gadgets": [
                {
                    "id": 23000521,
                    "name": "UTILITY BELT",
                    "description": "Buster heals himself and all nearby allies for 450 health for each ally in his Super's charge area."
                },
                {
                    "id": 23000522,
                    "name": "SLO-MO REPLAY",
                    "description": "Buster's next Lens Flare pulls enemies towards him."
                }
            ],
            "rarity": {
                "id": 100005,
                "name": "MYTHIC"
            },
            "attack": {
                "name": "Lens Flare",
                "description": "Buster shoots a cone of light from his projector, damaging all enemies within range."
            },
            "super": {
                "name": "Montage",
                "description": "Buster projects a shield in front of him, blocking all enemy projectiles and reflecting the energy back towards enemies."
            },
            "hypercharge": {
                "name": "Plot Armor",
                "description": "Buster's shield is now 360 degrees around him and reflected projectiles deal more damage!."
            },
            "class": {
                "name": "TANK",
                "id": 2011
            },
            "description": "Buster took a film projector from the movie theater where he works so he can play around with it like a prop. It's dangerous and highly unprofessional!"
        },
        {
            "id": 16000063,
            "name": "CHESTER",
            "starPowers": [
                {
                    "id": 23000527,
                    "name": "SINGLE BELL'O'MANIA",
                    "description": "The first bell of Chester's attack sequence does 200% damage."
                },
                {
                    "id": 23000528,
                    "name": "SNEAK PEEK",
                    "description": "Chester will always know what his next Super will be."
                }
            ],
            "gadgets": [
                {
                    "id": 23000529,
                    "name": "SPICY DICE",
                    "description": "Chester gets a new random Super that is different from his current one."
                },
                {
                    "id": 23000530,
                    "name": "CANDY BEANS",
                    "description": "Chester eats a mystery flavored candy bean from his cap, gaining a random buff for 5 seconds."
                }
            ],
            "rarity": {
                "id": 100006,
                "name": "LEGENDARY"
            }, "description": "Chester makes vicious fun of anyone in sight, trying to get under their skin. The more hate he gets, the better... especially if that hater is Mandy!",
            "forms": [
                {
                    "formName": "Default",
                    "attack": {
                        "name": "Cap And Bells",
                        "description": "Chester shoots a sequence of bells from his cap, first one, then two, then three, and lastly four bells."
                    },
                    "super": {
                        "name": "Jack-In-The-Box",
                        "description": "Chester's Super is randomly chosen from 5 different abilities each time it is charged."
                    }
                }
            ],
            "attack": {
                "name": "Cap And Bells",
                "description": "Chester shoots a sequence of bells from his cap, first one, then two, then three, and lastly four bells."
            },
            "super": {
                  "name": "",
                  "description": ""
            },
            "superVariations": [
                { "name": "Explosion - Candy Popper", "description": "Chester throws an exploding candy popper that destroys the environment, knocking back and damaging enemies."},
                { "name": "Stun - Jawbreaker", "description": "Chester shoots a large, hard candy that stuns enemies on hit." },
                { "name": "Poison - Salmiakki", "description": "Chester sprays a cone of salty salmiakki powder that poisons enemies, damaging them over time." },
                { "name": "Area - Pop Rocks", "description": "Chester sprinkles crackling pop rocks on the ground, damaging enemies over time when standing on it." },
                { "name": "Heal - Strong Mint", "description": "Chester eats a refreshing mint that heals him over time." }
            ],
            "hypercharge": {
                "name": "Crunchy, Chewy, Gooey",
                "description": "Chester combines 3 of his Super abilities into one. He throws a sweet that explodes and deals damage, spreads a poison cloud, and leaves a lingering slowing area to finish."
            },
            "class": {
                "name": "DAMAGE DEALER",
                "id": "2010"
            }
        },
        {
            "id": 16000064,
            "name": "GRAY",
            "starPowers": [
                {
                    "id": 23000535,
                    "name": "FAKE INJURY",
                    "description": "When Gray has full health, the next damage taken is reduced by 50%."
                },
                {
                    "id": 23000536,
                    "name": "NEW PERSPECTIVE",
                    "description": "When Gray or his Allies use Doors, they recover 660 health."
                }
            ],
            "gadgets": [
                {
                    "id": 23000537,
                    "name": "WALKING CANE",
                    "description": "Gray's next hit from the Finger Pistol shoots a walking cane which pulls enemies back by a bit."
                },
                {
                    "id": 23000538,
                    "name": "GRAND PIANO",
                    "description": "Draco can not fall under one health for 2 seconds."
                }
            ],
            "rarity": {
                "id": 100005,
                "name": "MYTHIC"
            },
            "attack": {
                "name": "Finger Pistol",
                "description": "Are the bullets even real?"
            },
            "super": {
                "name": "Dimensional Doors",
                "description": "Gray creates a set of doors for him and his teammates, useful for quick escapes and sneaky attacks!"
            },
            "hypercharge": {
                "name": "Another Dimension",
                "description": "Gray opens a new pair of portals that shield him and allies for 1000 when they pass through."
            },
            "class": {
                "name": "SUPPORT",
                "id": 2014
            },
            "description": "Gray styles himself as a character in an old silent film. He takes the act seriously but sometimes forgets to keep his mouth shut when doing finger bullets."
        },
        {
            "id": 16000065,
            "name": "MANDY",
            "starPowers": [
                {
                    "id": 23000543,
                    "name": "IN MY SIGHTS",
                    "description": "Mandy shoots her candies with 20% more speed while Focused."
                },
                {
                    "id": 23000544,
                    "name": "HARD CANDY",
                    "description": "Mandy receives 40% shield while Focused."
                }
            ],
            "gadgets": [
                {
                    "id": 23000545,
                    "name": "CARAMELIZE",
                    "description": "Mandy's next candy from her Candy Dispenser slows down enemies on hit for 2.5 seconds."
                },
                {
                    "id": 23000546,
                    "name": "COOKIE CRUMBS",
                    "description": "Mandy's next candy from her Candy Dispenser pierces enemies and environment."
                }
            ],
            "rarity": {
                "id": 100004,
                "name": "EPIC"
            },
            "attack": {
                "name": "Candy Dispenser",
                "description": "Mandy shoots candy from her Candy Dispenser and while staying still she gains Focus, increasing her attack range."
            },
            "super": {
                "name": "Sugar Ray",
                "description": "Mandy shoots a long ray of sugar passing through enemies and environment, dealing massive damage."
            },
            "hypercharge": {
                "name": "Sugar for All!",
                "description": "Mandy fires her Super in three different directions."
            },
            "class": {
                "name": "MARKSMAN",
                "id": 2012
            },
            "description": "Mandy runs a candy store where she dresses in costume and doles out sweet treats. She's a little too into the act and rules her candy kingdom with an iron fist."
        },
        {
            "id": 16000066,
            "name": "R-T",
            "starPowers": [
                {
                    "id": 23000553,
                    "name": "QUICK MATHS",
                    "description": "Marks created last 3 seconds longer."
                },
                {
                    "id": 23000554,
                    "name": "RECORDING",
                    "description": "R-T and his legs take 20% less damage when split."
                }
            ],
            "gadgets": [
                {
                    "id": 23000555,
                    "name": "OUT OF LINE",
                    "description": "Instantly charges R-T's Super."
                },
                {
                    "id": 23000556,
                    "name": "HACKS!",
                    "description": "Instantly trigger all active marks on all enemy brawlers, dealing their damage."
                }
            ],
            "rarity": {
                "id": 100005,
                "name": "MYTHIC"
            },
            "description": "R-T is designed to be a helpful information kiosk, but he's also been given the task of monitoring all activity within Starr Park. For safety reasons, of course.",
            "forms": [
                {
                    "formName": "Clyde (Cannon)",
                    "attack": {
                        "name": "Tap Target",
                        "description": "R-T fires a single projectile, that upon impact with a brawler, marks them. Any damage dealt to a marked target consumes the mark and deals extra damage."
                    },
                    "super": {
                        "name": "Hide And Seek",
                        "description": "R-T splits into two. R-T's legs are left behind while both R-T and his legs gain a short ranged, powerful attack that marks enemies. R-T moves faster while split."
                    }
                },
                {
                    "formName": "Split R-T",
                    "attack": {
                        "name": "Eat Static",
                        "description": "R-T and his legs blast a strong signal, damaging all targets around them."
                    },
                    "super": {
                        "name": "Radar Waves",
                        "description": "R-T instantly teleports to his legs, becomes whole again, and heals."
                    }
                }
            ],
            "hypercharge": {
                "name": "360-Degree Surveillance",
                "description": "Damaging security lasers surround R-T and his legs after using a Hypercharged Super."
            },
            "class": {
                "name": "DAMAGE DEALER",
                "id": "2010"
            },
            "attack": {
                "name": "",
                "description": ""
            },
            "super": {
                "name": "",
                "description": ""
            }
        },
        {
            "id": 16000067,
            "name": "WILLOW",
            "starPowers": [
                {
                    "id": 23000561,
                    "name": "LOVE IS BLIND",
                    "description": "Lantern's Curse also reduces reload speed of affected brawlers by 30%."
                },
                {
                    "id": 23000562,
                    "name": "OBSESSION",
                    "description": "Hexed enemies gain 33% movement speed while mind controlled."
                }
            ],
            "gadgets": [
                {
                    "id": 23000563,
                    "name": "SPELLBOUND",
                    "description": "Willow's next Lantern's Curse deals 300 more damage and applies the entire damage instantly rather than over time."
                },
                {
                    "id": 23000564,
                    "name": "DIVE",
                    "description": "Willow dives for 2 seconds, becoming untargetable but unable to take any action for the duration."
                }
            ],
            "rarity": {
                "id": 100005,
                "name": "MYTHIC"
            },
            "attack": {
                "name": "Lantern's Curse",
                "description": "Willow lobs her lantern, dealing damage over time to enemies hit."
            },
            "super": {
                "name": "Hex",
                "description": "Willow fires a single tadpole towards an enemy brawler, fully healing them and taking control over their mind if it hits. Willow can use the basic attack of the enemy brawler and move them as she pleases. Mind control breaks after 4 seconds or when the brawler reaches 30% HP."
            },
            "hypercharge": {
                "name": "Psychic Safety",
                "description": "Willow gains an invulnerability shield on landing her Hex. She remains shielded until the Hex is broken."
            },
            "class": {
                "name": "CONTROLLER",
                "id": 2013
            },
            "description": "Willow works as a gondoliera in the Swamp of Love. She gives couples in search of a romantic evening the creepiest, most unsettling time they could imagine."
        },
        {
            "id": 16000068,
            "name": "MAISIE",
            "starPowers": [
                {
                    "id": 23000569,
                    "name": "PINPOINT PRECISION",
                    "description": "Pressure rocket deals 20% more damage at max distance."
                },
                {
                    "id": 23000570,
                    "name": "TREMORS",
                    "description": "Enemies hit by Shockwave are also slowed down for 2 seconds."
                }
            ],
            "gadgets": [
                {
                    "id": 23000571,
                    "name": "DISENGAGE!",
                    "description": "Maisie blasts the ground, stunning enemies for 0.5 seconds while dashing forward."
                },
                {
                    "id": 23000572,
                    "name": "FINISH THEM!",
                    "description": "Maisie instantly reloads 1 ammo and increases the next Pressure Rocket damage by 30% of the target's missing HP."
                }
            ],
            "rarity": {
                "id": 100004,
                "name": "EPIC"
            },
            "attack": {
                "name": "Pressure Rocket",
                "description": "The further you run, the faster Maisie's rocket will reach you."
            },
            "super": {
                "name": "Shockwave",
                "description": "Don't get too close or a personal space will be created for you."
            },
            "hypercharge": {
                "name": "Aftermath",
                "description": "Maisie's Super also shoots her basic attack projectiles around her to all directions."
            },
            "class": {
                "name": "MARKSMAN",
                "id": 2012
            },
            "description": "Maisie works as a safety coordinator, but deep down she enjoys dangerous situations. Sometimes, it almost feels like she has a hand in creating them."
        },
        {
            "id": 16000069,
            "name": "HANK",
            "starPowers": [
                {
                    "id": 23000577,
                    "name": "IT'S GONNA BLOW",
                    "description": "When Balloon Blast is charged over 80%, Hank gains 10% extra movement speed."
                },
                {
                    "id": 23000578,
                    "name": "TAKE COVER!",
                    "description": "Hank takes 40% reduced damage for 3 seconds."
                }
            ],
            "gadgets": [
                {
                    "id": 23000579,
                    "name": "WATER BALLOONS",
                    "description": "The next Balloon Blast also slows down enemies for 3 seconds."
                },
                {
                    "id": 23000580,
                    "name": "BARRICADE",
                    "description": "Hank takes 40% reduced damage for 3 seconds."
                }
            ],
            "rarity": {
                "id": 100004,
                "name": "EPIC"
            },
            "attack": {
                "name": "Balloon Blast",
                "description": "The longer you hold, the deadlier the blast."
            },
            "super": {
                "name": "Fish Torpedoes",
                "description": "Hank launches Fish Torpedoes in all directions, and he heals for a part of his missing health."
            },
            "hypercharge": {
                "name": "Home Fish-iles",
                "description": "The Fish Torpedoes that Hank fires with his Super have been upgraded to home in on targets!"
            },
            "class": {
                "name": "TANK",
                "id": 2011
            },
            "description": "Hank is a one-shrimp, one-tank army on a mission to liberate sea life from kitchens and markets everywhere. Chefs, consider yourselves on notice!"
        },
        {
            "id": 16000070,
            "name": "CORDELIUS",
            "starPowers": [
                {
                    "id": 23000585,
                    "name": "COMBOSHROOMS",
                    "description": "Hitting the second mushroom to the same target as the first, deals 30% extra damage."
                },
                {
                    "id": 23000586,
                    "name": "MUSHROOM KINGDOM",
                    "description": "Cordelius spawns 3 mushrooms to the Shadow Realm after using his Super, healing allies and damaging enemies for 800 health on pickup."
                }
            ],
            "gadgets": [
                {
                    "id": 23000587,
                    "name": "REPLANTING",
                    "description": "Cordelius jumps over a piece of terrain quickly."
                },
                {
                    "id": 23000588,
                    "name": "POISON MUSHROOM",
                    "description": "Cordelius's next main attack shoots a poison mushroom that prevents the enemy from attacking for 1.0 seconds."
                }
            ],
            "rarity": {
                "id": 100006,
                "name": "LEGENDARY"
            },
            "attack": {
                "name": "Mushrooms",
                "description": "Cordelius shoots two mushrooms with his gardening tool, damaging enemies on hit."
            },
            "super": {
                "name": "This Is My Domain",
                "description": "Cordelius shoots a Shadow Mushroom that passes through walls and on hit transfers the target and him to the Shadow Realm for 8 seconds. Cordelius has 20% higher movement speed and 30% faster reload speed in the Shadow Realm."
            },
            "hypercharge": {
                "name": "Complete Darkness",
                "description": "Cordelius slows down his targets when sending them to the Shadow Realm"
            },
            "class": {
                "name": "ASSASSIN",
                "id": 2015
            },
            "description": "Gardener and caretaker of the Enchanted Forest. Obsesses over mushrooms and is hostile towards strangers."
        },
        {
            "id": 16000071,
            "name": "DOUG",
            "starPowers": [
                {
                    "id": 23000593,
                    "name": "FAST FOOD",
                    "description": "Resurrected targets gain increased movement speed for 3 seconds after being resurrected."
                },
                {
                    "id": 23000594,
                    "name": "SELF SERVICE",
                    "description": "Snack Attack also heals Doug by 20% of the normal value."
                }
            ],
            "gadgets": [
                {
                    "id": 23000595,
                    "name": "DOUBLE SAUSAGE",
                    "description": "The next Snack Attack only heals allies but doubles the amount."
                },
                {
                    "id": 23000596,
                    "name": "EXTRA MUSTARD",
                    "description": "The next Snack Attack only damages enemies but doubles the amount."
                }
            ],
            "rarity": {
                "id": 100005,
                "name": "MYTHIC"
            },
            "attack": {
                "name": "Snack Attack",
                "description": "Fresh food for friends, expired for others. Heals allies and damages enemies."
            },
            "super": {
                "name": "Second Serving",
                "description": "A special spiced up hot dog for a target ally or Doug himself. When a buffed Brawler is defeated they will come back with 100% health after a short delay."
            },
            "hypercharge": {
                "name": "Free Toppings",
                "description": "Doug's Snack Attack is also mirrored for the ally buffed with the Second Serving."
            },
            "class": {
                "name": "SUPPORT",
                "id": 2014
            },
            "description": "Doug's hot dogs will extend your friends' shelf life."
        },
        {
            "id": 16000072,
            "name": "PEARL",
            "starPowers": [
                {
                    "id": 23000601,
                    "name": "HEAT RETENTION",
                    "description": "Super will consume 50% less Heat when used."
                },
                {
                    "id": 23000602,
                    "name": "HEAT SHIELD",
                    "description": "While the Heat is over 80%, reduce damage taken by 20%."
                }
            ],
            "gadgets": [
                {
                    "id": 23000603,
                    "name": "OVERCOOKED",
                    "description": "Next basic attack shoots burning cookies, dealing 25% extra damage over 3 seconds."
                },
                {
                    "id": 23000604,
                    "name": "MADE WITH LOVE",
                    "description": "Next basic attack shoots perfectly baked cookies healing allies for 25% of the damage overtime instead."
                }
            ],
            "rarity": {
                "id": 100004,
                "name": "EPIC"
            },
            "attack": {
                "name": "Hot Cookies",
                "description": "Rapid fire hot cookies directly out from the oven, slightly cooling the oven while damaging enemies on hit. The higher the Heat the higher the damage."
            },
            "super": {
                "name": "Let Out Some Steam",
                "description": "Consume and release all the built up Heat in an explosion, damaging all nearby enemies. The higher the Heat the higher the damage."
            },
            "hypercharge": {
                "name": "Pyrolytic",
                "description": "Let Out Some Steam leaves a burning area behind for 4.5 seconds."
            },
            "class": {
                "name": "DAMAGE DEALER",
                "id": 2010
            },
            "description": "Against all odds, Pearl found her way into Belle and Sam's hardened hearts thanks to her disarmingly warm nature. Besides, who can resist chocolate cookies?"
        },
        {
            "id": 16000073,
            "name": "CHUCK",
            "starPowers": [
                {
                    "id": 23000609,
                    "name": "PIT STOP",
                    "description": "Increase the maximum amount of Posts by 1."
                },
                {
                    "id": 23000610,
                    "name": "TICKETS PLEASE!",
                    "description": "Dashing through enemies with his Super will also steal 33% of their ammo."
                }
            ],
            "gadgets": [
                {
                    "id": 23000611,
                    "name": "REROUTING",
                    "description": "Chuck removes the nearest Post and recharges his Super."
                },
                {
                    "id": 23000612,
                    "name": "GHOST TRAIN",
                    "description": "Chuck's next Super can go through walls!"
                }
            ],
            "rarity": {
                "id": 100005,
                "name": "MYTHIC"
            },
            "attack": {
                "name": "Steam Engine",
                "description": "Shoots a cloud of steam from Chuck's hat, piercing and damaging enemies."
            },
            "super": {
                "name": "Steam Engine",
                "description": "Dash to the nearest Post in line of sight, damaging enemies on the way. While no Posts are in line of sight, throw a new Post to the ground."
            },
            "hypercharge": {
                "name": "Full Steam Ahead!",
                "description": "Chuck has unlimited range on his next dash and leaves clouds of damaging steam behind him!"
            },
            "class": {
                "name": "CONTROLLER",
                "id": 2013
            },
            "description": "Once a brilliant maestro, now a train conductor, Chuck traded the symphonies of the concert halls for the cacophonies of the Ghost Station, all in the hope of discovering the next big thing in music!"
        },
        {
            "id": 16000074,
            "name": "CHARLIE",
            "starPowers": [
                {
                    "id": 23000623,
                    "name": "DIGESTIVE",
                    "description": "Cocooned enemies lose 25% of their health while cocooned."
                },
                {
                    "id": 23000624,
                    "name": "SLIMY",
                    "description": "Cocoon leaves a slimy trail behind it for 5 seconds that slows down enemies walking over it."
                }
            ],
            "gadgets": [
                {
                    "id": 23000625,
                    "name": "SPIDERS",
                    "description": "Charlie releases 3 spiders that seek and attack the nearest enemies."
                },
                {
                    "id": 23000626,
                    "name": "PERSONAL SPACE",
                    "description": "Charlie cocoons herself, healing 50% of her total health."
                }
            ],
            "rarity": {
                "id": 100005,
                "name": "MYTHIC"
            },
            "attack": {
                "name": "Yo-Yo",
                "description": "Charlie slings her yo-yo forward, damaging the first enemy hit and then returning back to her."
            },
            "super": {
                "name": "Cocoon",
                "description": "Charlie throws forward a bundle of hair wrapping around an enemy on hit, disabling them until the hairy cocoon is destroyed."
            },
            "hypercharge": {
                "name": "Pestilence",
                "description": "Cocoon spawns 3 spiders that seek and attack the nearest enemies."
            },
            "class": {
                "name": "CONTROLLER",
                "id": 2013
            },
            "description": "Itsy bitsy Charlie, Put on a crazy show, She let down her hair, And made off with all your dough. In came the crowd, It filled up the circus tent, So Charlie weaved away while, Taking every cent!"
        },
        {
            "id": 16000075,
            "name": "MICO",
            "starPowers": [
                {
                    "id": 23000637,
                    "name": "MONKEY BUSINESS",
                    "description": "Every 5 seconds, Mico's basic attack steals ammo from his enemies after hitting them."
                },
                {
                    "id": 23000638,
                    "name": "RECORD SMASH",
                    "description": "Mico deals 100% extra damage against non brawlers."
                }
            ],
            "gadgets": [
                {
                    "id": 23000639,
                    "name": "CLIPPING SCREAM",
                    "description": "Mico lets out a deafening scream towards the nearest enemy, dealing 285 damage and slowing down enemies for 2 seconds on hit."
                },
                {
                    "id": 23000640,
                    "name": "PRESTO",
                    "description": "Mico's next jump has 34% longer range."
                }
            ],
            "rarity": {
                "id": 100005,
                "name": "MYTHIC"
            },
            "attack": {
                "name": "Mic Boom",
                "description": "Mico jumps forward for a short distance attacking with his mic boom and damaging nearby enemies after landing."
            },
            "super": {
                "name": "Out Of Frame",
                "description": "Mico jumps out of frame, becoming invulnerable while controlling his landing position and damaging nearby enemies when landing."
            },
            "hypercharge": {
                "name": "Sound Check",
                "description": "Mico's super also stuns nearby enemies after landing for 1.5 seconds."
            },
            "class": {
                "name": "ASSASSIN",
                "id": 2015
            },
            "description": "Mico's the sound guy in Brawlywood, but one could be forgiven for thinking he's actually a celebrity given all the bragging and name-dropping. Hot-tempered and unstable, he cannot take a joke. Don't ever call him funny..."
        },
        {
            "id": 16000076,
            "name": "KIT",
            "starPowers": [
                {
                    "id": 23000646,
                    "name": "POWER HUNGRY",
                    "description": "Kit gains 150% power from each Power Cube."
                },
                {
                    "id": 23000647,
                    "name": "OVERLY ATTACHED",
                    "description": "Kit attaches to friendly brawlers for 5 seconds longer."
                }
            ],
            "gadgets": [
                {
                    "id": 23000648,
                    "name": "CARDBOARD BOX",
                    "description": "Hide in a cardboard box becoming invisible for 3 seconds. Charges the Super 100% faster while stationary."
                },
                {
                    "id": 23000649,
                    "name": "CHEESEBURGER",
                    "description": "Heals himself and the friendly Brawler he is attached to for 30%."
                }
            ],
            "rarity": {
                "id": 100006,
                "name": "LEGENDARY"
            },
            "description": "Stuck giving autographs to his rabid fans at Starr Toon Studios, cartoony superstar Kit often daydreams of becoming relevant in the industry again, respected for his acting chops rather than his looks.",
            "forms": [
                {
                    "formName": "Kit",
                    "attack": {
                        "name": "Claws",
                        "description": "Claw nearby enemies in a cone."
                    },
                    "super": {
                        "name": "Carry Me",
                        "description": "Jump and attach to the back of another Brawler. Heals allies and damages enemies over time."
                    }
                },
                {
                    "formName": "Kit in Ally",
                    "attack": {
                        "name": "Yarn Balls",
                        "description": "Throw exploding yarn balls while attached to a friendly Brawler."
                    },
                    "super": {
                        "name": "-",
                        "description": "-"
                    }
                }                                
            ],
            "hypercharge": {
                "name": "Making Biscuits",
                "description": "Kit's Super stuns the enemy but he can move and attack normally. Attaching to teammates will heal them more and his Yarn Balls have a longer range."
            },
            "class": {
                "name": "SUPPORT",
                "id": "2014"
            },
            "attack": {
                "name": "",
                "description": ""
            },
            "super": {
                "name": "",
                "description": ""
            }
        },
        {
            "id": 16000077,
            "name": "LARRY & LAWRIE",
            "starPowers": [
                {
                    "id": 23000659,
                    "name": "PROTOCOL: PROTECT",
                    "description": "While Lawrie is in range, transfer 30% incoming damage to himself instead."
                },
                {
                    "id": 23000660,
                    "name": "PROTOCOL: ASSIST",
                    "description": "While Lawrie is in range, reload 30% of your ammo whenever he damages an enemy."
                }
            ],
            "gadgets": [
                {
                    "id": 23000661,
                    "name": "ORDER: SWAP",
                    "description": "Swap weapons with Lawrie."
                },
                {
                    "id": 23000662,
                    "name": "ORDER: FALL BACK",
                    "description": "Dash towards Lawrie while Lawrie dashes towards you, healing both for 25% of max health."
                }
            ],
            "rarity": {
                "id": 100004,
                "name": "EPIC"
            },
            "attack": {
                "name": "Ticket Dispenser",
                "description": "Shoot a ticket bundle over obstacles that explodes twice after landing, damaging nearby enemies."
            },
            "super": {
                "name": "Call For Backup",
                "description": "Throw a signal to summon your twin Lawrie for help. He will seek out any trouble makers and serve justice with his taser gun."
            },
            "hypercharge": {
                "name": "",
                "description": ""
            },
            "class": {
                "name": "ARTILLERY",
                "id": 2016
            },
            "description": "Larry sells tickets to Starr Park visitors under the watchful eye of his twin, Lawrie. Larry loves rules, they make life easier! Lawrie doesn't love rules so much as enforcing them. They make a good team."
        },
        {
            "id": 16000078,
            "name": "MELODIE",
            "starPowers": [
                {
                    "id": 23000667,
                    "name": "FAST BEATS",
                    "description": "Melodie gains 6% increased movement speed from each note orbiting her."
                },
                {
                    "id": 23000668,
                    "name": "EXTENDED MIX",
                    "description": "Melodie's notes last for 25% longer before vanishing."
                }
            ],
            "gadgets": [
                {
                    "id": 23000669,
                    "name": "PERFECT PITCH",
                    "description": "Melodie's notes get 25% increased movement speed and 60% wider orbit for 5 seconds."
                },
                {
                    "id": 23000670,
                    "name": "INTERLUDE",
                    "description": "Melodie gains 10% Shield from each note orbiting her."
                }
            ],
            "rarity": {
                "id": 100005,
                "name": "MYTHIC"
            },
            "attack": {
                "name": "Monster Notes",
                "description": "Melodie shoots tiny monster notes from her mic, damaging enemies and spawning orbiting notes around her on hit."
            },
            "super": {
                "name": "Catchy Chorus",
                "description": "Melodie can dash forward multiple times to catch her enemies."
            },
            "hypercharge": {
                "name": "Flash Mob",
                "description": "Melodie adds up to 3 Hypercharge notes using Catchy Chorus. Hypercharge notes do 300 damage."
            },
            "class": {
                "name": "ASSASSIN",
                "id": 2015
            },
            "description": "When it comes to Karaoke, Melodie shows no mercy. Armed with her kawaii looks and devilish set of pipes, she never fails to steal the limelight."
        },
        {
            "id": 16000079,
            "name": "ANGELO",
            "starPowers": [
                {
                    "id": 23000675,
                    "name": "EMPOWER",
                    "description": "Staying inside the Super will heal Angelo for 300 per second."
                },
                {
                    "id": 23000676,
                    "name": "FLOW",
                    "description": "Angelo gains 25% increased movement speed after entering water."
                }
            ],
            "gadgets": [
                {
                    "id": 23000677,
                    "name": "STINGING FLIGHT",
                    "description": "Fly into the air for 1.0 seconds. Drains 300 health from nearby enemies on takeoff."
                },
                {
                    "id": 23000678,
                    "name": "MASTER FLETCHER",
                    "description": "The next Take Aim pierces enemies and the environment."
                }
            ],
            "rarity": {
                "id": 100004,
                "name": "EPIC"
            },
            "attack": {
                "name": "Take Aim",
                "description": "Hold the aim to charge up your shots."
            },
            "super": {
                "name": "Welcome To The Swamp",
                "description": "Angelo creates a poison cloud that lasts for 8 seconds and damages enemies. While in the cloud, Angelo's arrows become poisoned, dealing extra damage over time."
            },
            "hypercharge": {
                "name": "In My Element",
                "description": "During Hypercharge, Angelo's Super follows him!"
            },
            "class": {
                "name": "MARKSMAN",
                "id": 2012
            },
            "description": "Angelo is the Love Swamp's resident cupid-turned-mosquito. They buzz around the canals looking for lovebirds to dazzle with their irresistible charm, even if those require a little extra, pointy incentive."
        },
        {
            "id": 16000080,
            "name": "DRACO",
            "starPowers": [
                {
                    "id": 23000734,
                    "name": "EXPOSE",
                    "description": "Every 5 seconds, the next Lance Stab exposes enemies on hit. Exposed enemies take 35% increased damage for 5 seconds."
                },
                {
                    "id": 23000735,
                    "name": "SHREDDING",
                    "description": "Dragon Solo now also heals when activated."
                }
            ],
            "gadgets": [
                {
                    "id": 23000736,
                    "name": "UPPER CUT",
                    "description": "The next Lance Stab also throws enemies in the air for a short time."
                },
                {
                    "id": 23000737,
                    "name": "LAST STAND",
                    "description": "Draco can not fall under one health for 2 seconds."
                }
            ],
            "rarity": {
                "id": 100006,
                "name": "LEGENDARY"
            },
            "attack": {
                "name": "Lance Stab",
                "description": "Draco thrusts his lance forward, piercing and damaging enemies in front of him, dealing more damage at max range."
            },
            "super": {
                "name": "Dragon Solo",
                "description": "Draco mounts up on his fire breathing dragon, gaining increased movement speed and damage reduction."
            },
            "hypercharge": {
                "name": "Fire and Flames",
                "description": "Draco's dragon breathes more flames in a wider area and with longer range."
            },
            "class": {
                "name": "TANK",
                "id": 2011
            },
            "description": "Riding his inflatable dragon and setting off fireworks, Draco promises a show-stopping finale every night. With his electric guitar blaring and his flame-spewing ride rocking the crowd, he turns the fantasy up to eleven!"
        },
        {
            "id": 16000081,
            "name": "LILY",
            "starPowers": [
                {
                    "id": 23000752,
                    "name": "SPIKY",
                    "description": "After teleporting to an enemy, Lily's next attack deals 530 more damage."
                },
                {
                    "id": 23000753,
                    "name": "VIGILANCE",
                    "description": "Gain 15% movement speed while an enemy is in her Super charge radius."
                }
            ],
            "gadgets": [
                {
                    "id": 23000754,
                    "name": "VANISH",
                    "description": "Lily enters the Shadow Realm for 3 seconds."
                },
                {
                    "id": 23000755,
                    "name": "REPOT",
                    "description": "The next flourish, becomes a thrown attack, and Lily teleports to the destination on impact."
                }
            ],
            "rarity": {
                "id": 100005,
                "name": "MYTHIC"
            },
            "attack": {
                "name": "Thorn in the Side",
                "description": "Lily stabs in front of her with her thorns, dealing damage."
            },
            "super": {
                "name": "Flourish",
                "description": "Throw a seed in a straight line. If it hits an enemy, Lily teleports behind them."
            },
            "hypercharge": {
                "name": "Germinate",
                "description": "Lily's Flourish now bounces off walls, and transports the enemy and Lily to the Shadow Realm for 5 seconds."
            },
            "class": {
                "name": "ASSASSIN",
                "id": 2015
            },
            "description": "A nerd at heart and a total witchcraft buff, Lily's thirst for knowledge once led her into the Enchanted Woods, where an incident involving a firefly and a carnivorous plant would change her life forever..."
        },
        {
            "id": 16000082,
            "name": "BERRY",
            "starPowers": [
                {
                    "id": 23000764,
                    "name": "FLOOR IS FINE",
                    "description": "Berry gains 50% increased reload speed when standing on his own melted ice cream."
                },
                {
                    "id": 23000765,
                    "name": "MAKING A MESS",
                    "description": "Berry's next attack gains 20% extra damage on impact when painting an unpainted area."
                }
            ],
            "gadgets": [
                {
                    "id": 23000766,
                    "name": "FRIENDSHIP IS GREAT",
                    "description": "Berry swipes his tail, knocking back enemies and healing nearby allies for 871 health."
                },
                {
                    "id": 23000767,
                    "name": "HEALTHY ADDITIVES",
                    "description": "Berry's next main attack area lasts for 100% longer."
                }
            ],
            "rarity": {
                "id": 100004,
                "name": "EPIC"
            },
            "attack": {
                "name": "Meltdown",
                "description": "Berry throws melted ice cream at a targeted area, damaging enemies and healing allies on impact and over time."
            },
            "super": {
                "name": "Sweet Swirl",
                "description": "Berry dashes forward, spinning and dropping melted ice cream around him, damaging enemies and healing allies on impact and over time."
            },
            "hypercharge": {
                "name": "Double Scoops",
                "description": "Sweet Swirl drops double the scoops of ice cream!"
            },
            "class": {
                "name": "SUPPORT",
                "id": 2014
            },
            "description": "Working at Mandy's Candy Shop, what could go wrong? EVERYTHING! Luckily, Berry has the patience and toughness of a workhorse. He seems to hate every second of his job, but at the end of his shift, you might catch a brief smile."
        },
        {
            "id": 16000083,
            "name": "CLANCY",
            "starPowers": [
                {
                    "id": 23000772,
                    "name": "RECON",
                    "description": "Clancy starts the match with 3 tokens."
                },
                {
                    "id": 23000773,
                    "name": "PUMPING UP",
                    "description": "Clancy reloads all of his ammo on every enemy takedown."
                }
            ],
            "gadgets": [
                {
                    "id": 23000774,
                    "name": "SNAPPY SHOOTING",
                    "description": "Clancy gains double tokens for 5 seconds."
                },
                {
                    "id": 23000775,
                    "name": "TACTICAL RETREAT",
                    "description": "Clancy dashes and reloads 1 ammo."
                }
            ],
            "rarity": {
                "id": 100005,
                "name": "MYTHIC"
            },
            "attack": {
                "name": "Power Wash",
                "description": [
                    "Clancy's attacks upgrade each stage.",
                    "STAGE 1: Clancy fires one paintball.",
                    "STAGE 2: Clancy fires a second paintball each attack!",
                    "STAGE 3: Clancy fires 2 additional paintballs diagonally each attack!"
                ]
            },
            "super": {
                "name": "Torret",
                "description": [
                    "Clancy's Super upgrades each stage.",
                    "STAGE 1: Clancy fires a torrent of paintballs in a cone in front of him.",
                    "STAGE 2: Paintballs travel further.",
                    "STAGE 3: Paintballs deal 16% additional damage!"
                ]
            },
            "hypercharge": {
                "name": "Recall of Duty",
                "description": "Clancy's Super paintballs pierce enemies then quickly return to him, dealing damage again."
            },
            "class": {
                "name": "DAMAGE DEALER",
                "id": 2010
            },
            "description": "There's no turning back with Clancy (unless Hank orders him to). He's fully embraced his fake crustacean life and will do anything for his comrades."
        },
        {
            "id": 16000084,
            "name": "MOE",
            "starPowers": [
                {
                    "id": 23000804,
                    "name": "SKIPPING STONES",
                    "description": "Moe's basic attacks bounce one more time. The range of the attack remains the same."
                },
                {
                    "id": 23000805,
                    "name": "SPEEDING TICKET",
                    "description": "Moe's Driller has increased travel speed."
                }
            ],
            "gadgets": [
                {
                    "id": 23000806,
                    "name": "DODGY DIGGING",
                    "description": "Moe digs up some 'borrowed' goods, increasing his Super charge rate by 50% for 5 seconds."
                },
                {
                    "id": 23000807,
                    "name": "RAT RACE",
                    "description": "Moe dashes a short distance in his Driller, destroying walls and knocking back Brawlers in the process."
                }
            ],
            "rarity": {
                "id": 100005,
                "name": "MYTHIC"
            },
            "description": "Moe is a blind rat, found living in the Starr Park sewers by Grom, who then quickly adopted him! Now part of Starr Park's maintenance team, Moe uses his special digging machine, Driller, to traverse the sewer tunnels... and also cause a bit of destruction throughout the park, much to Ash's dismay.",
            "forms": [
                {
                    "formName": "Moe",
                    "attack": {
                        "name": "Shovel Slinger",
                        "description": "Moe throws a rock that bounces once, breaking into a smaller rock. Each rock smashes into stones on impact. Rocks and stones both deal damage."
                    },
                    "super": {
                        "name": "Torret",
                        "description": "Moe gets into his trusty Driller, drilling to targeted location, dealing damage and knocking brawlers up at the destination. He gains a new attack in his Driller form."
                    }
                },
                {
                    "formName": "Driller",
                    "attack": {
                        "name": "Giga Drill Break",
                        "description": "Moe starts drilling in front of him, gaining movement speed and dealing damage to enemies in front of him."
                    },
                    "super": {
                        "name": "Ball Out",
                        "description": "Moe exits his Driller and returns to his normal form."
                    }
                }
            ],
            "hypercharge": {
                "name": "The Big Cheese",
                "description": "Moe's Driller has longer range and lasts for longer!"
            },
            "class": {
                "name": "DAMAGE DEALER",
                "id": "2010"
            },
            "attack": {
                "name": "",
                "description": ""
            },
            "super": {
                "name": "",
                "description": ""
            }
        },
        {
            "id": 16000085,
            "name": "KENJI",
            "starPowers": [
                {
                    "id": 23000815,
                    "name": "STUDIED THE BLADE",
                    "description": "Slashimi's slices have 30% longer range."
                },
                {
                    "id": 23000816,
                    "name": "NIGIRI NEMESIS",
                    "description": "After avoiding damage for 5 seconds, gets 60% damage reduction from the next enemy attack."
                }
            ],
            "gadgets": [
                {
                    "id": 23000817,
                    "name": "DASHI DASH",
                    "description": "Kenji's basic attack only uses Dash for the next 3 seconds."
                },
                {
                    "id": 23000818,
                    "name": "HOSOMAKI HEALING",
                    "description": "Kenji instantly heals 75% of damage taken over the last 3 seconds."
                }
            ],
            "rarity": {
                "id": 100006,
                "name": "LEGENDARY"
            },
            "attack": {
                "name": "Dash 'N' Slash",
                "description": "Kenji's basic attacks alternate between a Dash and a Slash. Dash deals damage to all enemies in a straight line and Slash deals damage to all enemies in a wide area in front of him."
            },
            "super": {
                "name": "Slashimi",
                "description": "Kenji targets an area with precise slices, dealing heavy damage and gaining invulnerability for the duration of the Super."
            },
            "hypercharge": {
                "name": "All You Can Eat",
                "description": "Pulls enemies to the middle of his Super, and re-appears in the center of the X instead of at the starting location."
            },
            "class": {
                "name": "ASSASSIN",
                "id": 2015
            },
            "description": "This highly skilled sushi chef has a wholesome life running his restaurant in Starr Park, but it feels like he's trying to hide something about his past... though his sushi tastes so good, nobody cares!"
        },
        {
            "id": 16000086,
            "name": "SHADE",
            "starPowers": [
                {
                    "id": 23000832,
                    "name": "SPOOKY SPEEDSTER",
                    "description": "Hitting opponents with the center of Shade's main attack gives a short movement speed."
                },
                {
                    "id": 23000833,
                    "name": "HARDENED HOODIE",
                    "description": "Shade gets 30% damage reduction while in its Incorporeal Form."
                }
            ],
            "gadgets": [
                {
                    "id": 23000834,
                    "name": "LONGARMS",
                    "description": "The next main attack has 50% longer range."
                },
                {
                    "id": 23000835,
                    "name": "JUMP SCARE",
                    "description": "Shade spooks nearby enemies, slowing them for 4 seconds."
                }
            ],
            "rarity": {
                "id": 100004,
                "name": "EPIC"
            },
            "attack": {
                "name": "Haunted Hug",
                "description": "Shade hugs its opponents with a wide embrace, accidentally dealing damage, and doing more damage to those caught in the center of the hug. It can also hug enemies through walls!"
            },
            "super": {
                "name": "Incorporeal Form",
                "description": "Shade leaves the physical world and can move directly through the environment. It also gains a movement speed boost."
            },
            "hypercharge": {
                "name": "The Frightener",
                "description": "Shade's attacks during its Hypercharged Super all deal maximum damage, even if the enemy is not hugged in the center."
            },
            "class": {
                "name": "ASSASIN",
                "id": 2015
            },
            "description": "Not much is known about this mysterious pile of clothes, other than the fact it has some cool sunglasses. Discovered by Gus, Shade was given a name and now the two spooky Brawlers haunt the Ghost Station together."
        },
        {
            "id": 16000087,
            "name": "JUJU",
            "starPowers": [
                {
                    "id": 23000848,
                    "name": "GUARDED GRIS-GRIS",
                    "description": "Gris-Gris is summoned with a protective shield."
                },
                {
                    "id": 23000849,
                    "name": "NUMBING NEEDLES",
                    "description": "Gris-Gris' attack now also slows the enemy for 1 sec."
                }
            ],
            "gadgets": [
                {
                    "id": 23000850,
                    "name": "VOODOO CHILE",
                    "description": "Juju's next main attack has the power of all three elements."
                },
                {
                    "id": 23000851,
                    "name": "ELEMENTALIST",
                    "description": "Juju gains a temporary buff based on the current environment she is standing on. Earth: Damage reduction .Grass: Invisibility. Water: Increased movement speed."
                }
            ],
            "rarity": {
                "id": 100005,
                "name": "MYTHIC"
            },
            "attack": {
                "name": "Elemental Energy",
                "description": "Juju throws projectiles empowered by the environment she is standing on, giving them different properties! Ground: More damage .Grass: More range. Water: Has a slowing effect"
            },
            "super": {
                "name": "From the Other Side",
                "description": "Juju summons Gris-Gris. This spooky voodoo doll drags itself to the nearest enemy and throws damaging needles."
            },
            "hypercharge": {
                "name": "",
                "description": ""
            },
            "class": {
                "name": "ARTILLERY",
                "id": 2016
            },
            "description": "Juju owns the Oddities Shop and is followed everywhere by her “pet” voodoo doll, Gris-Gris (pronounced Gregory). Although she can control the elements, Juju is also a talented toymaker who makes dolls to sell to Starr Park's many visitors."
        },
        {
            "id": 16000089,
            "name": "MEEPLE",
            "starPowers": [
                {
                    "id": 23000875,
                    "name": "DO NOT PASS GO",
                    "description": "When you shoot through environment, deal 300 more damage."
                },
                {
                    "id": 23000876,
                    "name": "RULE BENDING",
                    "description": "Critical success also increases allies' reload speed within the area by 20%."
                }
            ],
            "gadgets": [
                {
                    "id": 23000877,
                    "name": "MANSIONS OF MEEPLE",
                    "description": "Meeple's next attack creates dice towers around the impact area and deals 500 damage."
                },
                {
                    "id": 23000878,
                    "name": "RAGEQUIT",
                    "description": "Meeple lashes out in rage at nearby enemies, stunning them and knocking them back. Ragequit stuns for a longer period of time the fewer hitpoints."
                }
            ],
            "rarity": {
                "id": 100004,
                "name": "EPIC"
            },
            "attack": {
                "name": "Boomhaven",
                "description": "Meeple shoots various projectiles that will slightly home towards the nearest enemy."
            },
            "super": {
                "name": "Critical Success",
                "description": "Meeple cheats, somehow rolling a NAT21 on a d20, allowing all team projectiles in the Super area to pierce through environment for 10 seconds."
            },
            "hypercharge": {
                "name": "",
                "description": ""
            },
            "class": {
                "name": "CONTROLLER",
                "id": 2013
            },
            "description": "Meeple knows the rules to every board game in existence and if you break them... Well let's just say you don't want to break them. They hate cheaters and those who don't follow the rules. There's one exception to the rules... Meeple themselves!"
        },
        {
            "id": 16000090,
            "name": "OLLIE",
            "starPowers": [
                {
                    "id": 23000883,
                    "name": "KICK, PUSH",
                    "description": "While near walls, Ollie kicks off his hoverboard and gains 20% extra movement speed."
                },
                {
                    "id": 23000884,
                    "name": "RENEGADE",
                    "description": "After dashing forward with his Super, Ollie gains a 4000 decaying shield over 4 seconds."
                }
            ],
            "gadgets": [
                {
                    "id": 23000885,
                    "name": "REGULATE",
                    "description": "Ollie jumps and does a rad kickflip, hypnotizing all enemies where he lands for 1.0 seconds."
                },
                {
                    "id": 23000886,
                    "name": "ALL EYEZ ON ME",
                    "description": "Ollie's next attack will hypnotize any enemies hit for 1.0 seconds."
                }
            ],
            "rarity": {
                "id": 100005,
                "name": "MYTHIC"
            },
            "attack": {
                "name": "Bring the Ruckus",
                "description": "Ollie's hoverboard fires soundwaves which deal damage and go through enemies."
            },
            "super": {
                "name": "Hypnotize'",
                "description": "Ollie dashses forward with a gnarly hoverboard trick and starts charging a music blast, dealing 800 damage and hypnotizing all enemies around him for 2.5 seconds. While charging the music blast, Ollie will use up to 50% of his max ammo. Enemies will move towards Ollie and cannot be controlled while being hypnotized."
            },
            "hypercharge": {
                "name": "Ain't No Half-Supering",
                "description": "Ollie now jumps! His music blast area is larger and it won't consume ammo when it starts charging."
            },
            "class": {
                "name": "TANK",
                "id": 2011
            },
            "description": "Ollie rides his customized hoverboard around Starr Park, grinding rails and causing trouble! A fan of old school hip hop, Ollie blasts his favorite tunes wherever he goes. His music is infectious... literally. Brawlers can't help but dance when they hear it."
        },
        {
            "id": 16000091,
            "name": "LUMI",
            "starPowers": [
                {
                    "id": 23000905,
                    "name": "42% BURNT",
                    "description": "The explosions from Lumi's Blast Beat also set the area alight for 4 seconds. Fire damage also scales with explosion damage. Damage per second for the biggest explosion: 280."
                },
                {
                    "id": 23000906,
                    "name": "HALF-TIME",
                    "description": "Lumi slows enemies hit by her recalled morning stars for 1 seconds."
                }
            ],
            "gadgets": [
                {
                    "id": 23000907,
                    "name": "HIT THE LIGHTS",
                    "description": "Lumi ignites her morning stars on the ground, producing flames which damage nearby enemies for 3.9 seconds. Damage per second: 180. Cooldown: 14 seconds."
                },
                {
                    "id": 23000908,
                    "name": "GRIM AND FROSTBITTEN",
                    "description": "Lumi creates freezing winds around her morning stars on the ground, creating a slippery surface for 3.9 secs. Cooldown: 23 seconds."
                }
            ],
            "rarity": {
                "id": 100005,
                "name": "MYTHIC"
            },
            "attack": {
                "name": "Good Morning... Star",
                "description": "Lumi throws one of her morning stars. She can throw both of her weapons, with her third attack recalling them, dealing damage to any enemies caught in their path!"
            },
            "super": {
                "name": "Blast Beat",
                "description": "Lumi pounds the ground three times, causing explosions that deal area damage. The third explosion briefly snares enemies, making them unable to move but still able to attack."
            },
            "hypercharge": {
                "name": "Drum Solo",
                "description": "The final explosion from Lumi's Super has an extra blast on both sides."
            },
            "class": {
                "name": "DAMAGE DEALER",
                "id": 2010
            },
            "description": "A passionate metalhead and a talented drummer, Lumi traded her drumsticks for morning stars when she got her job at Starr Park. She controls elements of ice and fire, which reflects her shy nature and her burning passion for music!"
        },
        {
            "id": 16000092,
            "name": "FINX",
            "starPowers": [
                {
                    "id": 23000915,
                    "name": "HIEROGLYPH HALT",
                    "description": "Finx reduces the reload speed of any enemy Brawlers hit by his main attack by 30% for 3 seconds."
                },
                {
                    "id": 23000916,
                    "name": "PRIMER",
                    "description": "Damage dealt only from Finx's projectiles that are sped up by Time Warp, will increase the Super duration by 0.25 seconds each."
                }
            ],
            "gadgets": [
                {
                    "id": 23000917,
                    "name": "BACK TO THE FINXTURE",
                    "description": "Finx steps back in time, returning to the position and ammo he had 3 seconds ago. Cooldown: 18 seconds."
                },
                {
                    "id": 23000918,
                    "name": "NO ESCAPE",
                    "description": "Finx's next center projectile from his main attack freezes the enemy in time for 2 seconds, making them unable to take actions for the duration, but also making them immune to any damage. Cooldown: 17 seconds."
                }
            ],
            "rarity": {
                "id": 100005,
                "name": "MYTHIC"
            },
            "attack": {
                "name": "Chronocast",
                "description": "Finx fires 3 long range projectiles, with the outer ones dealing 50% of the damage of the center projectile."
            },
            "super": {
                "name": "Time Warp",
                "description": "Finx warps time in an area, decreasing the projectile speed of enemy Brawlers caught in the Super, while increasing the projectile speed of any teammates and himself. Finx's projectiles will also get a damage buff."
            },
            "hypercharge": {
                "name": "Temporal Traveling",
                "description": "Finx activates an additional Time Warp around himself that follows his movement."
            },
            "class": {
                "name": "CONTROLLER",
                "id": 2013
            },
            "description": "The owner of Starr Park's escape room, Finx is meant to help visitors complete tasks. Instead, he uses his time controlling abilities to cause mischief! Also, he LOVES cats."
        },
        {
            "id": 16000093,
            "name": "JAE-YONG",
            "starPowers": [
                {
                    "id": 23000929,
                    "name": "THE CROWD GOES MILD",
                    "description": "Being near teammates gives Jae-yong a 10% speed boost per teammate in range."
                },
                {
                    "id": 23000930,
                    "name": "EXTRA HIGH NOTE",
                    "description": "Main Attacks now deal an additional 20% Damage per target pierced."
                }
            ],
            "gadgets": [
                {
                    "id": 23000931,
                    "name": "WEEKEND WARRIOR",
                    "description": "Deals area damage and increases main attack damage for 5 sec."
                },
                {
                    "id": 23000932,
                    "name": "TIME FOR A SLOW SONG",
                    "description": "Jae-yong slows enemies around him and his attacks will leave trails of slowing paperwork for 5 sec."
                }
            ],
            "rarity": {
                "id": 100005,
                "name": "MYTHIC"
            },
            "attack": {
                "name": "Work Hard, Play Hard",
                "description": [
                    "Fires a piercing projectile, with different effects depending on Jae-yong's mode. ",
                    "WORK: Deals less damage, but creates slipstreams with projectiles that give speed boosts to teammates and himself. ",
                    "PARTY: Heals teammates with a piercing, damaging projectile."
                ]
            },
            "super": {
                "name": "Mix It Up",
                "description": [
                    "Switch between Jae-yong's Work & Party modes! Switching modes changes Jae-yong's main attack and activates the matching ability. ",
                    "WORK: Gives all nearby teammates a temporary movement speed boost. ",
                    "PARTY Heals all nearby teammates."
                ]
            },
            "hypercharge": {
                "name": "",
                "description": ""
            },
            "class": {
                "name": "SUPPORT",
                "id": 2014
            },
            "description": "By day, Jae-yong is your average office worker. By night, he is a karaoke GOD... or so he thinks. The jury is still out on his singing skills."
        },
        {
            "id": 16000094,
            "name": "KAZE",
            "starPowers": [
                {
                    "id": 23000938,
                    "name": "ADVANCED TECHNIQUES",
                    "description": "Ninja Aspect: Hitting an enemy in a Strike Spot also slows them by 30% for 2.5 sec. Geisha Aspect: When a marked enemy is defeated, they will deal damage to other enemies."
                },
                {
                    "id": 23000939,
                    "name": "GRATUITY INCLUDED",
                    "description": "Ninja Aspect: Removes 34% ammo from brawlers initially caught in the Fan Storm. Geisha Aspect: Increases duration of Gadget effects by 50%."
                }
            ],
            "gadgets": [
                {
                    "id": 23000940,
                    "name": "GRACIOUS HOST",
                    "description": "Ninja Aspect: Gain 30% Movement Speed for 2.5 sec. Geisha Aspect: Heal for 30% of max health."
                },
                {
                    "id": 23000941,
                    "name": "HENSOJUTSU",
                    "description": "Ninja Aspect: Gain invisibility for 2 sec. Geisha Aspect: Dash forward."
                }
            ],
            "rarity": {
                "id": 100007,
                "name": "ULTRA LEGENDARY"
            },
            "description": "Kaze was raised to be a living weapon by her parents, but this was not the life she wanted. After escaping to Starr Park with Kenji, she can now live how she wants. However, she is still torn between the two aspects of her life, being a humble geisha and a deadly ninja.",
            "forms": [
                {
                    "formName": "Geisha Aspect",
                    "attack": {
                        "name": "Kaze's Delivery Service",
                        "description": "Kaze dashes a short distance and strikes the nearest target. Kaze has a 'Strike Spot' at a fixed angle around herself. Hitting an enemy in a Strike Spot deals 200% damage and resets the Strike Spot to a new position."
                    },
                    "super": {
                        "name": "Fan Storm",
                        "description": "Kaze throws her fans, creating a deadly storm of fans in an area. Enemies within the Fan Storm can't see outside of it. The Fan Storm will also deal damage to an enemy if they touch it."
                    }
                },
                {
                    "formName": "Ninja Aspect",
                    "attack": {
                        "name": "Silent Shuriken",
                        "description": "Kaze throws 2 knives in succession, dealing increased damage to closer targets."
                    },
                    "super": {
                        "name": "Fish of the Brawl Star",
                        "description": "Kaze dashes a long distance and marks enemies she passes through. Marks explode after 2.5 seconds."
                    }
                }
            ],
            "hypercharge": {
                "name": "Ancient Energy",
                "description": "Ninja Aspect: The center of the Fan Storm damages enemies over time. Geisha Aspect: Kaze gains increased dash speed and her marks instantly damage if the target's health is low enough to be defeated."
            },
            "class": {
                "name": "ASSASSIN",
                "id": "2015"
            },
            "attack": {
                "name": "",
                "description": ""
            },
            "super": {
                "name": "",
                "description": ""
            }
        },
        {
            "id": 16000095,
            "name": "ALLI",
            "starPowers": [
                {
                    "id": 23000989,
                    "name": "LIZARD LIMBS",
                    "description": "While enraged, Alli regenerates health faster out of combat after only 1.5 seconds."
                },
                {
                    "id": 23000990,
                    "name": "YOU BETTER RUN, YOU BETTER TAKE COVER",
                    "description": "Alli reloads 40% faster while enraged."
                }
            ],
            "gadgets": [
                {
                    "id": 23000991,
                    "name": "FEED THE GATORS",
                    "description": "The next main attack heals Alli for 100% of damage dealt. Cooldown: 10 seconds."
                },
                {
                    "id": 23000992,
                    "name": "COLD-BLOODED",
                    "description": "Alli becomes enraged for the next 6 secs. Can only be activated when an enemy is visible. Cooldown: 14 seconds."
                }
            ],
            "rarity": {
                "id": 100005,
                "name": "MYTHIC"
            },
            "attack": {
                "name": "Swamp Swipe",
                "description": "Alli dashes forward, swiping as she goes. When in a bush or water, Alli will leap forward instead. The range of Swamp Swipe scales with her movement speed"
            },
            "super": {
                "name": "Stalker",
                "description": "Alli gains stealth (pulsing invisibility). Attacking does not break stealth. The next main attack she does will deal increased damage based on the enemy's current health percent. The higher their current health, the more damage Alli will deal!"
            },
            "hypercharge": {
                "name": "",
                "description": ""
            },
            "class": {
                "name": "ASSASSIN",
                "id": 2015
            },
            "description": "Alli is the shy mechanic of the Love Swamp. She loves to get her hands dirty, by either fixing broken machines or... mercilessly stalking other Brawlers. If you're walking home late at night and hear an odd noise, it's probably Alli trying to say hello."
        },
        {
            "id": 16000096,
            "name": "TRUNK",
            "starPowers": [
                {
                    "id": 23000998,
                    "name": "NEW INSECT OVERLORDS",
                    "description": "Ants also reduce the damage of enemies by 15%."
                },
                {
                    "id": 23000999,
                    "name": "COLONY SCOUTS",
                    "description": "Ants reveal hidden enemies."
                }
            ],
            "gadgets": [
                {
                    "id": 23001000,
                    "name": "FOR THE QUEEN!",
                    "description": "Trunk instantly spreads ants in a large area. Cooldown: 7 seconds."
                },
                {
                    "id": 23001001,
                    "name": "WORKER ANTS",
                    "description": "Trunk heals from the first source of damage taken for the next 2 secs. Cooldown: 16 seconds."
                }
            ],
            "rarity": {
                "id": 100004,
                "name": "EPIC"
            },
            "attack": {
                "name": "Ant Attack!",
                "description": "Trunk spins in a circle after a short delay, dealing damage to enemies and dropping ants. Standing near ants gives Trunk a 20% movement speed boost and 30% damage boost. The edge of the attack deals more damage to enemies."
            },
            "super": {
                "name": "Driven by Revenge (And Ants)",
                "description": "Trunk propels themselves at enemies, dropping ants along the way. They can bounce off walls too!"
            },
            "hypercharge": {
                "name": "Retreat",
                "description": "Trunk's Super causes them to leave ants on enemies which deal damage over time."
            },
            "class": {
                "name": "TANK",
                "id": 2011
            },
            "description": "Trunk is a suspiciously uncanny looking tree. It couldn't be because Trunk is actually a colony of hyper-intelligent ants controlling a fake mechanical tree? No, that would be ridiculous."
        },
        {
            "id": 16000097,
            "name": "MINA",
            "starPowers": [
                {
                    "id": 23001039,
                    "name": "ZUM ZUM ZUM",
                    "description": "Mina's combo Attack 3 also heals for 50% of damage done."
                },
                {
                    "id": 23001040,
                    "name": "BLOWN AWAY",
                    "description": "Mina's Super also roots enemies on the spot."
                }
            ],
            "gadgets": [
                {
                    "id": 23001041,
                    "name": "WINDMILL",
                    "description": "Creates a wall of wind that blocks projectiles for 3 sec."
                },
                {
                    "id": 23001042,
                    "name": "CAPO-WHAT?",
                    "description": "Mina's next Super recharges instantly if it hits."
                }
            ],
            "rarity": {
                "id": 100005,
                "name": "MYTHIC"
            },
            "attack": {
                "name": "Capoeira Combo",
                "description": [
                    "Mina can cycle through three ranged attacks in a certain time period. If she doesn't attack fast enough, her combo is broken and the cycle restarts. ",
                    "Attack 1: Long range & narrow (800 dmg) ",
                    "Attack 2: Medium range & medium width (1400 dmg) ",
                    "Attack 3: Short range & wide (2200 dmg)"
                ]
            },
            "super": {
                "name": "Furacão 3000",
                "description": "Mina hits the air, creating a powerful hurricane which deals heavy damage and launches enemies in front of her."
            },
            "hypercharge": {
                "name": "",
                "description": ""
            },
            "class": {
                "name": "DAMAGE DEALER",
                "id": 2010
            },
            "description": "Mina is a b-girl who mixes capoeira into her breakdance battles like it's second nature. She hangs out at SK8 Beats with Ollie and uses his mixtapes to practice new moves!"
        },
        {
            "id": 16000098,
            "name": "ZIGGY",
            "starPowers": [
                {
                    "id": 23001047,
                    "name": "THUNDERSTRUCK",
                    "description": ""
                },
                {
                    "id": 23001048,
                    "name": "THE GREAT ZIGGINI",
                    "description": ""
                }
            ],
            "gadgets": [
                {
                    "id": 23001049,
                    "name": "ELECTRIC SHUFFLE",
                    "description": ""
                },
                {
                    "id": 23001050,
                    "name": "NOW YOU SEE ME...",
                    "description": ""
                }
            ],
            "rarity": {
                "id": 100005,
                "name": "MYTHIC"
            },
            "attack": {
                "name": "",
                "description": ""
            },
            "super": {
                "name": "",
                "description": ""
            },
            "hypercharge": {
                "name": "",
                "description": ""
            },
            "class": {
                "name": "",
                "id": "0"
            }
        }
    ],
    "paging": {
        "cursors": {}
    }
}